l1 = '''ASP (от англ. «Application Service Provider») — организация - провайдер, предоставляющая услуги по аренде программных продуктов и инфраструктуры на базе периодических платежей с доступом к приложениям через Интернет или виртуальную частную сеть
Абап (от англ. «ABAP», «Advanced Business Application Programming») — проприетарный внутренний язык программирования высокого уровня с синтаксисом, используемым в приложениях корпорации SAP
Абстрактная функция (или «чистая виртуальная функция», от англ. «abstract function») — это функция без определения, которую переопределяют дочерние классы
Ава (или «аватарка», от англ. «avatar») — графическое обозначение пользователя в Интернете (картинка/фото/изображение)
Авечка — звуковая карта Sound Blaster AWE32 на шине ISA, представленная Creative Technology в марте 1994 года
Автогад — система автоматизированного проектирования и черчения AutoCAD
Авторизация (от англ. «authorization») — процесс проверки (подтверждения) прав при попытке выполнения неких действий
Адаптив (или «адаптивный дизайн», от англ. «adaptation») — процесс адаптации веб-страниц или веб-интерфейса к использованию на экранах различных устройств
Аджайл (от англ. «Agile») — гибкая методология разработки, объединяющая в себе целый ряд подходов и практик, основанных на 12 принципах Манифеста гибкой разработки программного обеспечения, а также практические подходы к разработке
Админ (или «администратор», от англ. «admin») — специалист, занимающийся настройкой, совершенствованием и поддержкой IT-инфраструктуры, включая периферию, оборудование, программное обеспечение и сетевые подключения
АДСЛ (от англ. «ADSL», «Asymmetric Digital Subscriber Line») — технология, которая позволяет подключаться к интернету и обеспечивать высокоскоростную передачу данных через существующие телефонные линии
Айди (или «айдишник», от англ. «id», «identificator») — уникальный признак объекта, который позволяет отличить его от других объектов, то есть идентифицировать
Айпи (или «айпишник», «айпи-адрес», от англ. «IP», «Internet Protocol Address») — уникальный адрес компьютера в Сети, который присваивается провайдером индивидуально каждому устройству и даёт возможность выхода в Интернет
Айти (или «ИТ», «информационные технологии», от англ. «IT», «Information Technologies») — довольно обширный класс дисциплин и областей деятельности, которые относятся к современным технологиям. Другими словами, это отрасль, отвечающая за обработку, сбор, хранение и передачу информации с помощью технических устройств и вычислительной техники
Айти-евангелист (или «IT-проповедник», «it-пропагандист», от англ. «Technology evangelist») — человек, который профессионально занимается пропагандой в сфере IT. Как правило, такой человек собирает вокруг себя определенную группу людей для создания целевой аудитории для дальнейшего продвижения товара/услуги на рынке. Целью его деятельности является утверждение продукта как технологического стандарта на рынке
Айтишник (или «айтишнег», «ойтишнег», «ойтишник», от англ. «Information Technologies») — специалист в сфере информационных технологий. Чаще всего айтишниками сейчас называют всех программистов и людей, так или иначе связанных с компьютерами
Ака (от англ. «a.k.a», «also known as») — если дословно переводить, звучит как «еще известен как», «другими словами»
Аккаунт (или «акаунт», «ак», от англ. «account») — учетная запись, совокупность данных пользователя, необходимых для его аутентификации. Обычно создается после регистрации на каком-либо ресурсе (на сайте / в приложении/ в программе)
Акцесс (от англ. «access») — 1) уровень доступа пользователя; 2) реляционная система управления базами данных (СУБД) корпорации Microsoft, входящая в состав пакета Microsoft Office (широкий круг функций, в т.ч. связанные запросы, связь с внешними таблицами и базами данных)
Алгоритм — строго определенный порядок действий /система правил/ набор инструкций, предназначенных для решения определенной задачи
Альфа — Это внутренний/непубличный этап разработки ПО, во время которого разработчики дополняют программу новыми функциями, после чего тестировщики проверяют/испытывают измененную программу
Альяс (или «алиас») — псевдоним, короткое и легко запоминающееся имя, которое используют вместо длинного и сложного
Анлим (или «безлимит», от англ. «unlimited») — в широком смысле - неограниченный доступ к чему-либо
Аноним (или «анонимус», «анон», от англ. «anonym», «anonymous») — человек, по тем или иным причинам, скрывающий свою личность
Анпаблишед (или «унпаблишед», от англ. «unpublished») — неопубликованный или неизданный
Анрег — незарегистрированный пользователь, ранее не проходивший аутентификацию на ресурсе/программе
Апгрейд (от англ. «upgrade») — усовершенствование / обновление и модернизация компьютерной техники (железа), программного обеспечения, аппаратуры и т.д.
Апдейт (от англ. «update») — обновление/модернизация программного обеспечения (софта)
Апи (или «Апишка», от англ. «API», «Application Programming Interface») — программный интерфейс приложения или интерфейс прикладного программирования. Простыми словами, это описание вариантов взаимодействия компьютерных программ между собой
Апликуха (от англ. «application») — прикладное программное обеспечение (компьютерная программа / мобильное приложение), предназначенное для выполнения определённых задач
Аплинк (от англ. «uplink») — 1) вышестоящий линк, с которого узел забирает почту; 2) UpLink-порт - порт для каскадного соединения свитчей или хабов, у которых нет автоопределения обжима кабеля
Апрув (или «аппрув», «заапрувить», от англ. «approve») — подтверждение, согласие, одобрение чего-либо после проведения предварительной проверки/модерации
Аркмейл (от англ. «ArcMail») — архивированная почта, т.е. сжатая архиватором
Архиватор — программа, которая предназначена для сжатия файлов без потери качества в единый архив (например, 7-Zip, WinRAR и др.)
Асл (от англ. «age/sex/location») — категории для заполнения: возраст/пол/место жительства
Ассемблер (или «Асм», от англ. «Assembler») — это транслятор (переводчик), который преобразует программный код, написанный на языке Ассемблера, в машинный язык
Аттач (от англ. «attach») — файл, который прикреплён к электронному письму или XML
Аутбаунд (от англ. «outbound») — каталог с исходящей почтой
Аутсорс (или «аутсорсинг», от англ. «outsource») — распространенная практика, когда компания передает часть рабочих задач специалистам вне своего штата (фрилансерам / работникам других компаний)'''

l2 = '''BCP (от англ. «Business Continuity Planning») — деятельность, направленная на снижение рисков прерывания бизнеса. Затрагивает предупреждение негативных последствий подобных сбоев, а также последующее восстановление бизнеса до приемлемого уровня
Баг (или «программная ошибка», от англ. «bug») — некая ошибка/дефект в написанном коде/программе, из-за которой программа ведет себя неожиданно, и, как следствие, выдает неправильные результаты
Багоюзер (или «баггер») — пользователь, который в своих интересах использует баги программ (для получения выгоды, денег, продвижения и т. д.)
Баг репорт (от англ. «bug report») — уведомление или отчёт об ошибке, где содержится описание, причина её появления, приоритетом и прочими свойствами
База Данных (или «БД») — 1) программный или программно-аппаратный комплекс, разработанный для хранения большого объема различной информации; 2) совокупность данных, хранимых в соответствии со схемой данных, операции с которыми выполняют в соответствии с правилами средств моделирования данных
Байт (от англ. «byte») — базовая единица хранения и обработки информации, которая состоит из 8 битов
Бан (от англ. «ban») — способ контроля за его действиями пользователей за счет ограничения или полного лишения их определенных прав (например: оставлять комментарии, просматривать определённые страницы и т.д.)
Бандл (от англ. «bundle») — эффективный маркетинговый прием, направленный на продвижение как самого продукта, так и сопутствующих товаров
Баннер (от англ. «banner») — графическое или анимированное изображение, как правило, рекламного характера, размещаемое на интернет-площадках. Используется для привлечения внимания потенциальных клиентов
Банщик — дизайнер, который, с помощью графических редакторов, занимается версткой и созданием рекламных баннеров
Батник (или «бат», «бач», «бачфайл», от англ. «batch file») — пакетный файл, т.е. текстовый файл (MS-DOS, OS/2 или Windows), который содержит последовательность команд, служащих для исполнения командным интерпретатором. После запуска данного файла программа-интерпретатор (например, cmd.exe) читает его построчно и по порядку исполняет команды
Батон (или «батончик», «бАттон», от англ. «button») — элемент интерфейса приложения/компьютерной программы, простыми словами "кнопка" (радиобатоны и пуш‑батоны)
Бахнуть — сделать что-то быстро, на скорую руку, например, скорректировать или расширить функционал приложения
ББС (или «БиБиэС», «бибиэска», «доска», «борда», от англ. «bulletin board system») — доска объявлений в электронном формате — широко применяемый в эпоху веб 1.0 способ взаимодействия пользователей компьютеров через коммутируемые телефонные сети
Безголовый (от англ. «headless») — имеется ввиду компьютер, который работает без устройства для вывода визуала, т.е. дисплея/монитора. Это может быть, к примеру, сервер. Безголовая система обычно управляется через сетевое соединение
Бенефит (от англ. «benefit») — некий бонус, использующийся для мотивации сотрудников. Обычно это непрямое денежное или иное нематериальное вознаграждение
Бенч (от англ. «bench») — обычно, имеется ввиду режим ожидания, простой специалиста в связи с отсутствием новых задач/проектов (при этом он получает зарплату)
Бенчмарк (от англ. «Benchmark») — задача, которая является эталонным тестом производительности компьютерной системы. Обычно бенчмарки меряют в попугаях
Бета (от англ. «beta») — бета-версия - рабочая версия ПО/сайта/приложения, которая находится на стадии публичного тестирования и доработки
Бета-тест (от англ. «beta-test») — последнее испытание разрабатываемого продукта (ПО/приложения/сайта) перед его официальным выпуском
Бета-тестер (от англ. «beta-tester») — человек, добровольно принимающий участие в бета-тестировании разрабатываемого продукта (сайта/ПО/приложения)
Библиотека — набор скомпилированного кода (например, функций), который «упакован» для вторичного использования в других программах. Библиотеки необходимы, для расширения возможностей программ
Бигдата (от англ. «big data») — набор специализированных методов и инструментов, использующихся для хранения и обработки огромных объемов данных, т.е. таких, которые характеризуются «тремя V»: volume (объём), velocity (скорость прироста и обработки), variety (многообразие)
Бинк (от англ. «Bink») — сокращённое название мейлеров типа BinkleyTerm. Бинком сейчас, чаще всего, называют популярный IP-мейлер binkd
Бипер (от англ. «beep») — 1) встроенный динамик ПК; 2) устройство, которое служит для генерации тонов DTMF, используется совместно с телефонами, не поддерживающими тоновый набор; 3) цифровой пейджер
Бит (от англ. «bit») — минимальная неделимая единица измерения количества информации. Принимает два значения: вкл/выкл, да/нет, высокий/низкий и т.д. В двоичной системе исчисления это либо 0, либо 1
Биткоин (или «BTC», от англ. «bitcoin») — пиринговая платёжная система, появившаяся в 2009 году. В обороте - одноимённая единица для учёта операций (bitcoin): популярная электронная криптовалюта
Битый — некорректный / нерабочий / содержащий ошибку. Так, «битая ссылка» ведет на несуществующую страницу с ошибкой 404 (Error 404), «битые пиксели» - неправильно отображают цвета на мониторе
Блин — в компьютерной сфере так называют компакт-диск, CD, DVD, либо один из дисков в харде (жесткий диск)
Блинница (или «CD-привод») — привод компакт-дисков, устройство для записи и считывания информации с оптических дисков с помощью лазера
Блог (или «канал», от англ. «weblog») — дневник или журнал пользователя в Сети, в котором юзер ведет личные записи (в текстовом формате, фото или видео). Обычно, блог находится в открытом доступе и другие интернет-пользователи могу просматривать содержащиеся в нем записи. Следует отличать блог от гостевых книг, форумов и чатов
Блок-схема  — графическая схема/модель, предназначенная для описания алгоритмов или процессов, где шаги изображаются в виде блоков различной формы, соединённых между собой линиями, указывающими направление последовательности. Используется программистами в процессе разработки и анализа логики работы программных компонентов
Блокчейн (от англ. «blockchain») — методика построения непрерывной последовательной цепочки блоков (связного списка), которые содержат определенную информацию. Внесение изменений в информацию существующих блоков очень проблематично, т.к., чаще всего, копии цепочек блоков хранятся на множестве разных компьютеров независимо друг от друга. Кроме того, если необходимо внести какие-либо изменения в информацию одного из блоков, придётся редактировать и все последующие блоки
Блохи — шуточное название, обозначающее небольшие баги, т.е. незначительные проблемы в разработанном ПО, приложении, сайте
Блютус (или «блютуз», «блюпуп», «блютуф», «синий зуб», от англ. «Bluetooth») — технология беспроводной связи, которая обеспечивает обмен информацией между устройствами (ПК, ноутбуки, мобильные телефоны, принтеры, мыши, клавиатуры, джойстики, наушники и т.д.) на бесплатной и повсеместно доступной радиочастоте для ближней связи
Блястер — звуковая плата SoundBlaster, выпускаемая фирмой Creative Technology, для IBM PC-совместимых ПК
Бог — 1) главный администратор сайта/сети/сервера, у которого имеется максимальный уровень прав; 2) наивысший уровень в игре, при котором доступны все возможности (GodMode - режим бога)
Болванка — чистый компакт-диск, который не содержит на себе информацию
Борланд (или «Багланд», от англ. «Borland») — компания Borland International, которая занимается производством ПО, более знаменита как создатель популярных инструментов для разработчиков Turbo Pascal, Delphi, компилятора Borland С++
Бот (от англ. «robot») — ПО, предназначенное для автоматизации рутинных задач человека, иногда с зачатками искусственного интеллекта (к примеру, чат- бот на сайтах, который отвечает на заранее запрограммированные несложные вопросы)
Ботнет — компьютерная сеть, которая состоит из определенного количества хостов с действующими ботами — автономным ПО. Чаще всего, бот в составе ботнета - программа для скрытой установки на устройство жертвы, которая позволяет злоумышленнику выполнять некие действия с использованием ресурсов заражённого компьютера
Браузер (или «броузер», «бровсер», «бродилка», от англ. «browser») — программное обеспечение, которое устанавливается на компьютер или телефон, позволяя выходить в Интернет и просматривать веб-странички (Internet Explorer, Chrome, Opera и пр.)
Брейншторм (от англ. «brainstorm») — мозговой штурм, используется компаниями для генерации интересных идей и вариантов, а так же для поиска решений существующих проблем
БСОД (от англ. «BSoD: blue screen of death») — «синий экран смерти», уведомление о крупной ошибке системы в некоторых версиях OS Windows. Обычно требует перезагрузки системы
Буржунет — зарубежная часть интернета, которая находится за пределами русскоязычного сегмента. Часто под "буржунетом" подразумевают англоязычные сайты из Европы и США
Бутик — внутренний загрузочный файл компьютера (boot.ini) с параметрами запуска, использующийся загрузчиком NTLDR при запуске Windows NT
Бутить (или «ребутить») — перезагружать компьютер или ноутбук с помощью мыши или клавиатуры
Бутявка — загрузочная флэшка (дискета), на которой находится записанный образ установочного диска и сам загрузчик
Буфер данных — это определённая часть памяти на устройстве, которая резервируется под временное хранение данных, в то время как они перемещаются из одного места в другое
Бэд (или «бады», «бэдмейл», от англ. «bad») — почта, которая дошла получателю с ошибками, либо же неформальное название области, куда эта почта попадает (Badmail)
Бэды (или «бэдблоки», «бэдсекторы», от англ. «badsector», «badblock») — не читающийся/ненадежный кластер диска, который содержит в себе сбойные сектора, или помечен как таковой в структурах файловой системы
Бэкап (от англ. «backup») — резервное копирование, т.е. создание резервной копии информации/проекта/сайта, для того, чтобы при каких-либо ошибках и сбоях иметь возможность восстановить данные. Безопасным считается регулярное обновление бэкапов и хранение их на различных устройствах
Бэкенд (от англ. «back-end») — непосредственно сама программно-аппаратная или серверная часть приложения, а также разработка этой «внутренней части» сайтов/ПО/приложений
Бэклог (от англ. «backlog») — перечень задач по функционалу в порядке приоритета для реализации в следующих версиях продукта'''

l3 = '''Вай-Фай (или «ви-фи», «вафля», от англ. «Wi-Fi») — технология беспроводных локальных сетей с устройствами на основе стандартов IEEE 802.11
Валидатор — программное обеспечение или ресурс, проверяющие на правильность написанные код или форму
Валидация (от англ. «validation») — это проверка систем, процессов, пользователей насколько они соответствует определенным заданным условиям
Валидный (от англ. «valid») — допустимый, корректный, приемлемый. Тот, который соответствует установленным правилам и условиям
Варез (от англ. «warez») — интеллектуальная собственность или ПО, свободно распространяемое в Интернете, незаконным путем с нарушением прав правообладателя
Варезник — сайт (обычно, файлообменник), на котором в открытом доступе присутствует "варез" (пиратское ПО, кинофильмы/музыка, книги и т.д.)
Варнинг (или «ворнинг», от англ. «warning») — предупреждающее сообщение в интерфейсе. Не является ошибкой, но может иметь негативные последствия для написанного кода
Вебинар (от англ. «web based seminar») — это выступление, лекция или презентация на выбранную тему, проходящая в сети Интернет в онлайн режиме. Также, вебинаром называют и запись проведенного ранее онлайн вебинара
Видюха (или «видяха», «видимо-карта») — видеокарта, т.е. устройство, которое обрабатывает информацию и преобразует графический образ в форму, пригодную для дальнейшего вывода на экран монитора. Простыми словами, это та деталь, с помощью которого изображение выводится на монитор
Визит — каждое посещение/заход пользователя на веб-страницу сайта, не зависимо от того, сколько разделов он в итоге посетит
Вики (или «википедия») — общедоступная многоязычная универсальная интернет-энциклопедия со свободным контентом, созданная и поддерживаемая сообществом добровольных редакторов с использованием системы редактирования на основе wiki
Вилдкарды (от англ. «wildcard characters») — так же их называют "символы-джокеры" или "символы подстановки" — символы, используемый для замены других символов или их последовательностей, тем самым приводя к символьным шаблонам. Другими словами, это некая переменная, которая служит "заглушкой" и обычно означает значение/строку, которая должна была быть на ее месте
Винда (или «виндоза», «виндоуз», «виндовоз», от англ. «windows») — операционная система Windows, впервые созданная корпорацией Microsoft в 1985 году. Простыми словами, это главная программа, которая начинает работать после включения ПК и позволяет юзеру работать с файлами, использовать Интернет и запускать различные программы
Винт (или «веник», «винчестер», «жёсткий диск») — накопитель на жёстких магнитных дисках - одно из самых важных составных частей любого ПК. Это запоминающее устройство для хранения/накопления данных на компьютере
Вирус (или «вирь») — вид вредоносного ПО, которое способно незаконно встраиваться в написанный код различных программ, системные области памяти, загрузочные секторы и т.д., тем самым нанося вред. Основной целью вирусов является самораспространение по средствам различных каналов связи (обычно, при скачивании вредоносного файла из ненадежных источников)
Виснуть (или «вешаться») — состояние, при котором компьютер или конкретная программа/приложение не отвечает на команды и запросы пользователя
Витуха (или «витя», «витюха», «витая пара») — определенный вид кабеля связи (витая пара), представляющий собой изолированные пары скрученных между собой проводников в пластиковой оболочке
Войтивайти — «войти в IT»: шуточный термин, обозначающий процесс перепрофилирования специалиста, далёкого от сферы IT в разработчика
Ворд — текстовый редактор Microsoft Word, предназначенный для создания, просмотра, редактирования и форматирования текстовых файлов
Воркшоп (от англ. «workshop») — мероприятие обучающего характера для специалистов из определённой сферы деятельности (программистов, фотографов, дизайнеров и т.д.). Обучение проводит обычно один из ведущих работников компании, вместе с которым участники совместно выполняют определенное задание/решают проблему
Выделенка — выделенная линия, т.е. подключение к интернет-провайдеру с использованием индивидуальной линии (кабеля) и сетевой карты
Выкатить — вывести приложение/программу/сайт в открытый доступ для всех пользователей
Выпадашка — элемент интерфейса ПО/приложения/сайта, сделанный по типу «выпадающего списка» («droplist»). Используется в тех случаях, когда необходимо что-то конкретизировать/детализировать, не перегружая при этом большим количеством информации главный экран'''

l4 = '''Гаджет (от англ. «gadget») — небольшой электронный прибор/девайс, который предназначен для того, чтобы помогать человеку в его деятельности
Гайд (от англ. «guide») — прописанная инструкция, руководство по достижению определенной цели, правила и порядок действий при выполнении поставленной задачи
Гамать (или «геймить», от англ. «to game») — играть
Геймдев (от англ. «game development») — процесс разработки игр под определенную платформу
Геймер (от англ. «gamer») — человек, проводящий время в игре
Геймпад (от англ. «gamepad») — игровой пульт, тип игрового манипуляторы. В отличии от джойстика, удерживается одной рукой, а для нажатия используются большие пальцы рук (в современных геймпадах также часто используются указательный и средний пальцы)
Геймплей (от англ. «gameplay») — игровой процесс, сюжет игры, описывающий, порядок взаимодействия игрока с игровым миром, то, как он реагирует на действия игрока и как определяется набор действий, который предлагает игроку игра
Гейт  (от англ. «gate») — 1) сетевой шлюз, устройство/ПО, которое сопрягает разнородные компьютерные сети; 2) электронное устройство или плагин динамической обработки, предназначенный для контроля уровня звукового сигнала (он пропускает сигнал выше установленного уровня и не пропускает сигнал ниже этого уровня)
Гектар (или «гиг») — другое название гигабайта (кратен единице байта) - единица измерения количественной информации, равная 109 (1 000 000 000) или 230 (1 073 741 824) байт
Генерить (или «сгенерить», от англ. «generate») — сгенерировать, создать что-то новое, сформировать что-либо. Часто применяется по отношению к новым идеям и вариантам
Гестуры (от англ. «gestures») — определенные движения по экрану пальца или стилуса, которые позволяют заменить те или иные команды или их последовательности. Это существенно ускоряет и упрощает работу на мобильных устройствах
Гик (от англ. «geek») — индивид, хорошо разбирающийся в каком-либо направлении деятельности и являющийся фанатом своего дела. Сейчас под гиками довольно часто подразумевают айтишников/программистов
Гит — 1) система контроля и управления версиями Git, консольная утилита для отслеживания и ведения истории изменения файлов в проекте; 2) веб-сервис GitHub для хостинга IT-проектов и совместной работы над ними
Гитхаб (от англ. «GitHub») — крупный веб-сервис для хранения (хостинга) репозиториев IT-проектов и совместной работы над ними. GitHub является своеобразной соц. сетью для программистов, которая позволяет им ознакомится с кодом друг друга, прокомментировать его и помочь в разработке
Гифка (или «гифчик», «гиф») — растровый графический файл в формате GIF, анимированное цифровое изображение, состоящее из небольшого количества кадров (фреймов), бесконечно сменяющих друг-друга, создавая тем самым некий сюжет/ небольшой мультфильм
Глаз — помимо обычного значения, в it-сфере так называют монитор компьютера -устройство, отображающее видео и графическую информацию, которую генерирует видеокарта
Глобальные переменные — переменные, объявленные вне блока. Они создаются при запуске программы и уничтожаются после её завершения. Их можно использовать в любом месте файла, после их объявления
Глюк — случайная редкая ошибка в программе, вызванная неправильно написанным кодом, либо работой каких-либо сторонних программ
Гмыл (или «джимейл», «жимейл») — имеется ввиду почтовый сервис Gmail от Google или непосредственно сам почтовый ящик на gmail.com
Грызун — компьютерная мышь, специальное устройство для управления курсором и передачи определенных команд ПК
Гуглить — искать информацию в поисковой строке браузера. Изначально использовалось применительно только к поисковой системе Google, но теперь применяется и к остальным поисковиками
Гуй (или «GUI», от англ. «Graphical User Interface») — графический интерфейс пользователя, состоящее из окон, разнообразных меню, кнопок и прочих виджетов
Гуру — в общем смысле употребляется как синоним слов: учитель, духовный наставник, уважаемый человек, профессионал, опытный мастер. В it-сфере гуру называют крутых программистов'''

l5 = '''Даблклик (от англ. «double click») — двойное нажатие
Даблтап (от англ. «double tap») — двойное короткое нажатие (тап) на выбранный элемент интерфейса сенсорного дисплея, сродни даблклику
Дамп  (от англ. «dump») — файл, содержащий резервную копию системы/памяти компьютера/базы данных, актуальную на момент его создания. В разработке дампы применяют для создания и поддержания в актуальном состоянии системы бэкапа
Дата центр (или «ЦОД», от англ. «data center») — это специализированное здание для размещения и обслуживания серверного, сетевого оборудования
Даунлинк (от англ. «downlink») — нижестоящий линк, которому данный узел отдаёт почту
Даунлоад (от англ. «download») — процесс передачи (скачивания) файловых данных из одного устройства в другое
Даунлоадер (или «менеджер загрузок», от англ. «downloader») — программное обеспечение, предназначенное для загрузки/скачивания файлов
Движок (или «двигло») — прикладная часть программного кода (программа/часть программы/комплекс программ/библиотека), выделенная для реализации определенной задачи
Двухголовый — в it имеется ввиду компьютер с двумя мониторами, либо двухъядерный процессор
Дебажить  (от англ. «debug», «debugging») — производить поиск ошибок/багов в программе с последующим их исправлением
Девайс (или «девица», «дежице», от англ. «device») — любое полезное техническое устройство/приспособление, конструктивно законченная техническая система, имеющая определённое функциональное назначение (ноутбук/смартфон/планшет/умные часы и т.д.).
Девелопер (или «разработчик», от англ. «developer») — специалист, который непосредственно занимается разработкой ПО и приложений
Девелопмент  (от англ. «development») — разработка чего-либо: сайтов, программного обеспечения, приложений, игр и т.д.
Дед (или «голый дед», от англ. «GoldEd») — русифицированное произношение "GoldED" и "GoldED+": популярного редактора сообщений для Фидонет и совместимых сетей
Дедикейтед (или «выделенный сервер», от англ. «dedicated») — хостинг с предоставлением клиенту реально существующей машины (в отличии от виртуального хостинга)
Дедлайн  (от англ. «deadline») — крайний итоговый срок, к которому должна быть выполнена та или иная задача/сдан проект/достигнута цель
Декремент (от англ. «decrement») — уменьшение значения переменной на заданное значение (обычно, на единицу)
Делфи (от англ. «Delphi») — императивный, структурированный, объектно-ориентированный, высокоуровневый язык программирования со строгой статической типизацией переменных. В основном, используется для написание прикладного ПО
Демка (или «демо», от англ. «demo», «demonstration») — 1) демонстрационная версия чего-либо (приложения, подписки, ПО), зачастую, с ограниченным функционалом или с коротким пробным периодом пользования; 2) жанр компьютерного искусства, заключающийся в создании мультимедийной презентации. Демки создаются в целях демонстрации возможностей и знаний в области программирования, компьютерной графики
Деплой  (или «задеплоить», от англ. «deploy») — развёртывание (перенос/помещение) программного обеспечения (исполняемого кода) на выбранный сервер или конкретное устройство, где оно будет работать
Десктоп  (или «дэсктоп», от англ. «desktop») — 1) тип корпуса системного блока компьютера, настольный компьютер, предназначенный для постоянного размещения на столе; 2) рабочий стол - вся площадь экрана при работе в операционной системе
Деструктор (от англ. «destructor») — это специальный тип метода класса, который выполняется при удалении объекта класса. Деструкторы созданы для деинициализации объекта (очистки памяти) после инициализации класса с помощью конструкторов
Дефолтный  (или «по дефолту», от англ. «default») — значения, которые присваиваются параметрам автоматически («по умолчанию») в тех случаях, когда юзер не задал им ни одно из допустимых значений
Джаббер (или «Жаббер», от англ. «JABBER») — открытый протокол для быстрого обмена сообщениями ХМРР, а также собирательное название работающих с его использованием клиентских программ
Джава (или «жаба», «ява», от англ. «java») — язык программирования, который используется для написания приложений, работающих в под управлением веб-браузера, а также для мобильных устройств
Джаваскрипт (или «жабаскрипт», «яваскрипт», от англ. «JavaScript») — мультипарадигменный язык программирования, который поддерживает объектно-ориентированный, императивный и функциональный стили
Джампер (или «JP», от англ. «jumper pins») — 1) небольшой переключатель на материнской плате и других картах, на аппаратном уровне фиксирующий какой-либо параметр; 2) перемычка , которая дает возможность выставить режим работы устройства с помощью замыкания ( размыкания ) нескольких контактов
Джуниор (или «джун», «июнь», от англ. «Junior Developer») — общепринятое в it название младшего разработчика (начальный уровень программиста), специалиста без опыта или с минимальным опытом работы
Диалап (или «Коммутируемый доступ», от англ. «dial-up») — коммутированное удаленное соединение, подключение к провайдеру, используя модем и телефонную сеть общего пользования
Дидос (или «дидосить», «задидось», «ДДоС», от англ. «Distributed Denial of Service») — массированная атака на сетевые ресурсы или каналы связи с помощью заражённых «третьих» компьютеров-зомби с целью сделать их недоступными для легитимных пользователей. DDoS-атаки заключаются в единовременной отправке ресурсу огромного количества запросов с одного или многих компьютеров, расположенных в сети Интернет
Динамическая библиотека (или «общая библиотека») — фактически исполняемый файл. Состоит из подпрограмм, которые подгружаются в вашу программу во время её выполнения (каждый раз в момент создания процесса). При компиляции программы, которая использует динамическую библиотеку, эта библиотека не становится частью вашего исполняемого файла — она ​​так и остается отдельным модулем
Динамический массив (от англ. «dynamic array») — массив, который способен изменять свой размер ​​во время выполнения программы и дает возможность более гибкой работы с данными (позволяет не составлять прогноз объёмов данных, а регулировать размер в зависимости от требуемых объёмов)
Директория  (или «дира») — синоним слова «каталог», папка с какими-либо файлами на ПК
Директ  (от англ. «direct») — 1) Яндекс.Директ - сервис для продвижения товаров и услуг с помощью контекстной рекламы в поисковой системе Яндекса и у его партнеров; 2) отправка данных напрямую, в обход роутинга; 3) мессенджер внутри приложения Instagram, позволяющий пользователем обмениваться сообщениями
Диск — 1) любой смонтированный в системе носитель информации, имеющий в названии «букву» ("Диск С", "Диск D"); 2) CD или DVD диск (оптический носитель информации, на котором процесс записи и считывания информации осуществляется с помощью лазера)
Дисконнект (или «отконнектиться», «расконнектиться», от англ. «disconnect») — временное отключение/разрыв/потеря связи или соединения
Дистр (или «Дистрибутив») — форма распространения программного обеспечения, установочный комплект файлов/ПО
Дистрибутив — форма распространения ПО, обычно дистрибутив содержит программу установщик с выбором режимов и параметров установки
Домен  (или «доменное имя», «доменный адрес», от англ. «domain») — 1) уникальный онлайн адрес/имя сайта, место его размещения в Интернете. Например, science.involta.ru — это домен второго уровня, который состоит из доменного имени science.involta и домена первого уровня .ru; 2) часть фидонетовского адреса, которая содержит название глобальной сети (@fidonet.org)
ДоС (от англ. «Denial of Service») — отказ сервера в обслуживании, невозможность обработки информации из-за множества поступающих запросов
Драйвер (или «драйверА», «дрАйверы», «дрова», от англ. «driver») — компьютерное ПО, с помощью которого другое ПО/ОС взаимодействует с аппаратным обеспечением, подключаемого устройства (наушники, принтер, колонки, видеокарта и т.д.)
Драй  (от англ. «DRY », «don’t repeat yourself») — в программировании принцип разработки ПО, предлагающий избегать повторений различной информации в коде (особенно в системах со множеством слоёв абстрагирования)
Дропбокс (от англ. «Dropbox») — файловый хостинг. При установке ПО на компьютере создаётся синхронизируемая папка, которая дает возможность юзеру размещать свои файлы на удалённых серверах при помощи клиента или через веб-интерфейс браузера
Дроплист (или «выпадашка», «дропдаун», от англ. «drop list») — элемент графического интерфейса пользователя (выпадающий / раскрывающийся список), дающий возможность юзеру выбрать одно из нескольких существующих значений параметра
Дропнуть (от англ. «drop») — в IT подразумевается обычно удаление чего-либо (базу данных, приложение, таблицу и т.д.)
Дыра (или «дырка») — "уязвимое место", возможность получить незаконный доступ к чему-либо (ПО, админке сайта и т.д.), которая не была предусмотрена разработчиками'''

l6 = '''Ебизнес (или «электронный бизнес», от англ. «e-Business») — бизнес-модель, в которой бизнес-процессы, обмен информацией и коммерческие транзакции осуществляются с помощью информационных систем
Еггогология — изучение и использование скрытых, недокументированных возможностей микрокалькуляторов
Египетские скобки (или «{ }») — стиль оформления кода в C-подобных языках, когда открывающие/закрывающие скобки ставятся в конце текущего ряда, это позволяет писать код более компактно
Еррор (или «Егор», «ЕГГОГ», от англ. «error») — ошибка, образуется при выполнении недопустимых условий или операций'''

l7 = '''Железо — материально-техническая часть/комплектующие компьютеров/ноутбуков/смартфонов и т.д.
Железячник — человек, на постоянной основе интересующийся/следящий за появлением нового "железа" (т.е. комплектующих компьютерной техники), хорошо разбирающийся в нём
ЖЖ (или «жижа», «жежешечка») — живой журнал, онлайн-дневник, который располагается на блог-платформе Livejournal.com
Жипег — (жопег, жпег) – растровый графический формат файлов JPEG (JPG), использующийся для хранения фотографий и других граических изображений
Жмыл (или «жмыло», «жмель») — популярный бесплатный почтовый сервис Gmail от Google, предоставляющий доступ к электронным почтовым ящикам
Жужунчик — флоппи-привод, дисковод, который предназначен для считывания и записи информации с дискет 3.5 дюйма'''

l8 = '''Зааджастить  (от англ. «to adjust») — немного поменять логику программы, внести легкие изменения, до настроить, привести в порядок, отрегулировать
Заасайнить таск  (от англ. «to assign», «task») — значит «поручить задание». Обычно, используется в контексте распределения рабочих задач между специалистами в программе‑менеджере
Забанить (или «забабить», «забананить», «послать в баню», от англ. «ban») — запретить доступ к выбранному ресурсу, лишить возможности пользователя отправлять сообщения на форуме или в чате
Забэкапить  (от англ. «back up») — сделать резервную копию чего-либо для последующего восстановления данных
Зависание  — нерегламентированное состояние, при котором одна или несколько программ или вся ОС полностью не реагируют на команды юзера
Заголовочные файлы  (или «заголовки», от англ. «header files») — в программировании обозначает файл, механически «вставляемый» компилятором в исходный текст, в том месте, где располагается некоторая директива
Задрот — 1) прозвище человека, слишком много времени уделяющего виртуальному миру (компьютерные игры, программирование и т.д.); 2) ярый фанатик своего дела, который сильно зациклен на нем (не зависимо от специальности), зачастую не очень приспособлены к реальной жизни
Зазиповать — перевести готовый архив с какими-то файлами в формат .zip
Законнектиться (или «подконнектиться», «приконнектиться», от англ. «connect») — присоединиться к чему-либо, установить связь, наладить контакт
Залить — загрузить файлы на сервер/сайт или закачать информацию в базу данный/файлообменник
Залогиниться  — войти в систему/программу в качестве зарегистрированного пользователя, с использованием определённого логина и пароля
Залочить (или «заблочить», от англ. «lock») — установить блокировку на персональное устройство (ПК, смартфон, планшет) для защиты от несанкционированного доступа сторонних лиц
Запилить — создать/сделать/выложить что-либо, добавить какую-то функциональность
Заплатка (или «патч») — дополнение или обновление, призванное исправить существующие ошибки/баги/глюки в системе или ПО. Процесс применения патча (заплатки) к программе называется пропатчиванием
Запостить (или «постить», от англ. «post») — 1) создать и выложить пост в социальной сети/блоге; 2) в сети Фидонет - посылать сообщения в эху
Зарарить — перевести готовый архив с какими-то файлами в формат .rar
Зарегать — произвести регистрацию чего-либо: учетной записи, программы, никнейма, канала, блога
Зарелизить  (от англ. «to release») — официально выпустить новую версию продукта, доступную для использования
Засейвить  (от англ. «save») — сохранить некую информацию/версию
Засерить — сделать выбранный элемент разрабатываемого интерфейса неактивным (обычно обозначается серым цветом)
Зафакапить  (от англ. «fuck up») — полностью провалить поставленную задачу, целиком испортить задание
Зафейлить (от англ. «fail») — небольшой прокол, например, не уложиться в заявленное время, выполняя задачу
Звуковуха (или «звучка», «звуковая карта», «музыкальная плата») — звуковая плата, позволяющая работать со звуками на ПК
Зловред — вредоносное ПО, обычно вирус или шпионская программа
Змея  (или «питон», «пайтон», от англ. «Python») — универсальный высокоуровневый скриптовый язык программирования, имеющий минималистичный синтаксис и направленный на повышение читаемости кода и увеличение производительности разработчика
Зомби — в it сфере так называют компьютеры, содержащие троянские программы
ЗЫ — то же, что латинское "PS" в кириллической раскладке. Означает постскриптум, т.е. дополнение к уже сказанному/написанному'''

l9 = '''Ибешник — специалист отдела информационной безопасности, занимающийся обеспечением конфиденциальности и сохранности данных компании и отдельных пользователей
Игнор  (от англ. «ignore») — 1) метка, которой один участник чата отмечает другого участника, при этом система игнорирует сообщения выбранного пользователя 2) простое игнорирование чьих-либо сообщений (не открывать/не читать/не отвечать
Идентификатор  (от англ. «identifier») — в языках программирования обозначает имя переменной/функции/класса или некого другого объекта
Иконка (или «значок», от англ. «icon») — элемент графического интерфейса, маленькая картинка, которая обозначает приложение/файл/каталог/ устройство и т. п.
ИК порт (или «инфракрасный порт», от англ. «IrDaA», «Infrared Data Association») — устройство, которое позволяет установить беспроводное соединение с любым устройством, тоже имеющим ИК-порт и находящимся в прямой видимости от аппарата
Икспи  (или «икспя», «хря», «хрюша», от англ. «XP») — Windows XP, операционная система семейства Windows NT корпорации Microsoft
Иксы (от англ. «Х») — так в разговорном языке называют стандарт X Window System, на котором, аналогично окошкам в ОС Windows, основана графическая оболочка в Linux-дистрибутивах
Имба (от англ. «imbalanced») — несбалансированный элемент, персонаж или предмет в компьютерной игре. Обычно термин применяется в онлайн-играх по отношению к более сильному на фоне остальных игроку/персонажу
Имплементация  (от англ. «implementation») — в объектно-ориентированном программировании термин обозначает практическую реализацию методов
Имплементить (от англ. «to implement») — реализовывать, исполнить намеченное
Имхо  (от англ. «IMHO», «In My Humble Opinion») — по моему скромному мнению. В русифицированной версии расшифровывается как: «Имею Мнение Хрен Оспоришь»
Индусский код  — код, который написан слишком длинно и "кудряво". Такое название связано с особенностями оплаты работы программистов в Индии: им платятза каждую строчку кода. Хитрые и прозорливые специалисты пользуются этим и прописывают лишние бесполезные строки
Инкапсуляция (от англ. «encapsulation») — 1) упаковка данных и/или функций в единый компонент; 2) процесс скрытого хранения деталей реализации объекта от пользователей/программистов) и предоставление им для работы интерфейсов классов
Инкремент (от англ. «increment») — уменьшение значения переменной на заданное значение (обычно, на единицу)
Инсталлировать (от англ. «install») — устанавливать некую программу/систему на ПК
Интегрированная среда разработки  (от англ. «IDE», «Integrated Development Environment») — это комплекс ПО, содержащего необходимые элементы для разработки, компиляции, линкинга и отладки кода
Интерактив  — двухсторонняя связь с сервером
Интерпретатор  (от англ. «Interpretation») — ПО, напрямую выполняющее написанный код, перед этим не проводя его компиляцию (т.е. не переводя его в машинный код)
Интранет — сеть внутри организации, которая используют протокол TCP/IP; может быть подключена к Интернету или существовать автономно и полностью изолированно
Информационная Безопасность (или «ИБ», от англ. «Information Security», « InfoSec») — практика сохранения и защиты информации от несанкционированного доступа, использования, раскрытия, искажения и редактирования
ИП (или «айпи», «айпишник», от англ. «ip», «Internet Protocol») — 1) протокол, обеспечивающий доставку пакетов, снабженных IP адресом; 2) группа из четырёх десятичных чисел, являющаяся уникальным адресом ПК или сайта в Сети
ИП динамический  — временный адрес, который выдается компьютеру при присоединении к провайдеру только на время текущей сессии
ИП статический  — постоянный адрес, который закреплен провайдером за конкретным ПК/сайтом
Ирка  — чат в системе IRC (Internet Relay Chat): протокол прикладного уровня, предназначенный для обмена сообщениями в режиме on-line. Обычно используется для группового общения, а также общения в личных сообщениях и обмена данными, в т.ч. файлами
Искалка  (или «ищейка») — компьютерная поисковая система, необходимая для удобного поиска необходимой информации (внутри устройства или в Сети)
Исходник — 1) файлы, с исходный кодом приложения, или сам исходный код; 2) первоначальный исходный материал (текст), на основе которого создается что-то новое
Итератор (от англ. «iterator») — интерфейс, предназначенный специально для перебора элементов контейнера (например, значений массива/символов в строке), обеспечивающий доступ к каждому из них во время перемещения (итеррирования) по элементам
Итерация (от англ. «iteration») — повторение определенного действия/шага/этапа'''

l10 = '''Казнет  — совокупность информационных технологий и инфраструктуры, обеспечивающих доступ к сети интернет, а также хостинг электронных ресурсов на территории Казахстана с присвоенным доменом первого уровня .kz
Камень (или «проц», «кристалл», «ЦП») — центральный процессор, основная составная часть каждого компьютера, выполняет в системе роль своеобразной мини атс
Капсить (от англ. «caps») — писать сообщения капсом (заглавными буквами), часто воспринимается как грубость - кричать/повышать голос. Крайне не приветствуется на форумах и в чатах без особой нужды
Капс  (от англ. «caps») — стиль регистра с заглавными буквами (верхний регистр). Термин пошел от названия кнопки «CapsLock», которая позволяет писать в верхнем регистре без нажатия клавиши «Shift»
Капча (от англ. «CAPTCHA») — картинка, предназначенная для проверки пользователя на предмет его реальности (не является ли он ботом). Капча используется с целью защиты от авто-регистраций и спам-ботов
Карбонка  (от англ. «carbon copies») — неформальное название специальной области, куда копируются личные письма из эхоконференций
Касперыч (или «каспер», «кашпировский», «кашперский») — Антивирус Касперского (ПО, предоставляющее юзерам защиту от всевозможных компьютерных вирусов, троянов, шпионских программ, руткитов с помощью проактивной защиты, включающей компонент HIPS)
Кастомер  (от англ. «customer») — покупатель, клиент или заказчик компании, который приобретает товары/услуги
Каталог  (или «директория», «справочник», «папка») — объект в файловой системе, который упрощает хранение и упорядочивание файлов
Катюша — процессор AMD K6, разработанный компанией AMD в 1997 году
Качалка  (от англ. «download manager») — менеджер загрузок, программа, которая обеспечивает возможность загрузки выбранных файлов из Интернета или локальной сети
КБПС  (или «кэбэпээс», от англ. «kbps - kilobitspersecond») — обозначение скорости сетевого соединения или битрейта мультимедийного файла, равное килобиту в секунду
Квотинг  (от англ. «quoting») — цитата, цитирование комментария/высказывания при интернет-общении. Иногда квотингом называют излишнее употребление цитат
Кейс  (от англ. «case») — реальная ситуация/случай из практики, произошедшие с человеком. Сейчас обычно используется применительно к опыту и конкретным наработкам специалиста, подтвержденным цифрами и наглядными примерами
Киберсквоттинг  (от англ. «cybersquatting») — приобретение или перехват на аукционе привлекательных/звучных доменных имен (регистрация) для их последующей выгодной перепродажи
Кибибайт (или «КиБ», от англ. «KiB») — единица, созданная в 1998 году для измерения количества информации. Равна 210 (1024) байт
Кило (или «кил») — килобайт, единица измерения количества информации, равная 1024 байтам (иногда 1000 байтам)
Килобакс  — единица счета денег, равная 1000 или 1024 долларам США. Принято использовать при расчете зарплат класса белых воротничков в Америки
Кирпич  — неработающее мобильное устройство (например, смартфон). Есть связанное понятие - "окирпичивание": это ситуация, когда кто-то сломал/сделал неработоспособным устройство
Клава (или «рояль») — клавиатура: устройство с комплектом клавиш, предназначенное для ввода/вывода данных и управления гаджетом, к которому оно подключено
Кладж (или «клудж», от англ. «kludge») — управляющие строки, которые содержат техническую информацию о письме, скрытую по умолчанию при просмотре в редакторе
Клик (от англ. «click») — имеет несколько значений: 1) щелчок - характерный звук нажатия клавиши на клавиатуре механического типа; 2) одиночное разовое нажатие кнопки мыши; 3) событие, которое возникает при нажатии кнопки мыши; 4) переход на сайт при нажатии на выбранную ссылку
Клон  (от англ. «clone») — 1) точная копия электронного устройства от популярного бренда, произведенная малоизвестным производителем; 2) копия сайта/платформы в Сети Интернет, созданная обычно для мошеннических действий
Кнопка (от англ. «Knopf») — 1) элемент интерфейса программы/сайта/приложения, созданный по аналогии с кнопками в технике (изображается в схожей стилистике и выполняет аналогичные функции); 2) любая клавиша на клавиатуре; 3) (кнопа) кнопка мыши
Ковёр (или «палас») — в компьютерной сфере так называют коврик для мыши
Коворкинг (от англ. «coworking») — современное арендованное помещение открытого типа, предназначенное для удобной и комфортной работы специалистов различных сфер деятельности, фрилансеров
Кодер  (или «кодерок», от англ. «coder») — обычно так называют программистов, которые занимаются непосредственно написанием программного кода
Кодить (от англ. «code») — заниматься программированием, т.е. реализацией задуманного алгоритма в виде кода разрабатываемого продукта
Код-ревью  (от англ. «code review») — аудит/проверка разработанного кода с целью нахождения и исправления ошибок, незамеченных при его написании
Код  (или «программный код») — 1) последовательность определенных команд (слов/символов) на каком-либо языке программирования; 2) ПО (исходный HTML код) сайта
Колокейшн  (от англ. «co-location») — услуга по размещению собственного физического сервера на чужой точке (специальная площадка в дата-центр)
Комбобокс  (от англ. «combo box») — поле с комбинированным списком – элемент графического интерфейса юзера, сочетающий в себе выпадающий список и однострочное текстовое поле для ввода значения вручную
Коммит (от англ. «git commit») — запись индексированных изменений в хранилище (репозиторий), содержащая данные об изменениях, комментарий и имя автора
Коммитить  (или «закоммитить», «сделать коммит», от англ. «commit») — проводить сохранение/фиксацию произведенных изменений кода в хранилище кода (репозиторий)
Коммуняка  — коммуникатор (прародитель современного смартфона), представляющий собой гибрид телефона и карманного компьютера
Компилить (от англ. «compilating») — осуществлять компиляцию, т.е. перевод написанного кода с языка программирования на машинный язык
Компилятор (от англ. «compilating») — программа, выполняющая компиляцию (перевод написанного кода с языка программирования на машинный язык)
Компиляция  (от англ. «compilating») — конвертация (перевод) кода, который был написан на высокоуровневом языке программирования, в исполняемую программу, позволяющую машине понять его напрямую
Комплейн  (от англ. «complain») — выражение недовольства/официальная жалоба координатору проекта
Комьюнити  (от англ. «community») — 1) ограниченное сообщество/группа людей, которые являются пользователями одного и того же сетевого ресурса/сообщества/приложения; 2) группа разработчиков и других специалистов, работающих над одним проектом или несколькими продуктами одной компании
Коннект (от англ. «connect») — в широком смысле это установленная связь между объектами. Если рассматривать применительно к it, то коннект - это обеспечение связи между удаленными компьютерами
Константа (от англ. «constant») — это переменная, значение которой не поддается изменению
Контент (от англ. «content») — содержательное наполнение сайта/соц.сети/блога (текстовки, изображения, аудио и видео файлы), поддающееся простому редактированию через админ-панель
Конфа (от англ. «conference») — 1) сокращенное название конференции: общение между группой людей (реальное собрание или удаленное по средствам интернет - соединения); 2) конфигурационный файл ПО, позволяющий изменять его настройки
Конфиг — текстовый конфигурационный файл, который используется для хранения директивы настроек системы/команды загрузки драйверов
Копипаст (от англ. «copy/paste») — команды "скопировать" и "вставить". Иногда так иронично называют псевдо-творческую деятельность, сводящуюся лишь к копированию уже существующей информации (человек-копипастер)
Кора дуба  — 64-разрядный микропроцессор Intel Core 2 Duo, основанный на микроархитектуре Core, созданный для клиентских систем
Корень — 1) корневая директория на диске: папка/каталог, являющаяся вышестоящей одновременно для всех существующих файлов и подпапок на устройстве; 2) root - аккаунт сисадмина в UNIX-подобных системах с полными правами
Корневой доступ  (или «рутинг», от англ. «root access») — полноценный доступ ко всем данным и управлению компьютером/машиной UNIX
Корэл  (или «корел», «корелдров», «король дров», «корявые дрова») — графический редактор CorelDraw для работы с векторными изображениями
Костыль  — наскоро реализованное решение проблемы в готовом коде. Является временной мерой, поддерживающей работоспособность программы, пока программисты трудятся над качественным глобальным решением
Котёнок  — в Фидонете: неформальное название мейлера KittenMail
Кракер  (или «крэкер», «крякер») — опытный программист, который пишет кряки для взлома программной системы защиты (иногда их ошибочно путают с хакерами)
Кракозябры (или «крякозябры») — набор случайных/непонятных символов, которые не поддаются расшифровки (РџСЂРёРІРµС‚! РњРµРЅСЏ). Обычно возникают на сайте при неправильной кодировке
Красная Шапочка  — операционная система Linux Red Hat: дистрибутив Linux, который выпускался в период с 1995 по 2003 год включительно
Красный глаз  (от англ. «IrDA — Infrared Data Association») — инфракрасный порт, передатчик данных, работающий в инфракрасном диапазоне
Кресты  (или «си-плюс-плюс», «плюс», «ссы») — язык программирования С++, широко используемый для разработки ПО, ОС, серверов, игр
Кроссплатформенный — ПО/сайт, который способен работать на нескольких аппаратных платформах и ОС
Крыса  — манипулятор типа «мышь» советсткого производства, отличающаяся от современных огромными размерами (примерно, с утюг)
Крысодром — коврик для манипулятора "мышь/крыса"
Крэш-полл  (или «крэшпол», «крешпул», от англ. «crash poll») — 1) непрерывная частая прозвонка на ноду, игнорирующая флаг времени работы ноды; 2) телефонное хулиганство
Кряк (или «крэк», «кряка», «крякалка», ««таблэтка»», «лекарство», от англ. «crack») — специальная программа или дополнение для взлома платного ПО, делающее возможным его бесплатное использование
Крякнуть  (или «крэкнуть», от англ. «crack») — взломать платное ПО с целью его дальнейшего бесплатного использования
Ксерить  — снимать копию бумажных документов с помощью ксерокса (копировального аппарата)
Ксерокс  (от англ. «Xerox») — копировальный аппарат для создания ч/б или цветных копий бумажной документации. Является именем нарицательным для всех копировальных машин, хотя раньше обозначало лишь аппарат фирмы Xerox
Ку — приветствие в чате/мессенджере, побуждающее начать разговор. Произошло от приветствия в фильме Кин-Дза-Дза
Кубизм — философия создания интернет-ресурсов, в соответствии с которой пользователь является и создателем, и потребителем контента
Куки (или «кука», «кукисы», «печенька», от англ. «cookies») — небольшой файл текстового формата, который сайт посылает на диск пользователя для его идентификации и сохранения настроек
Кулер (от англ. «cooler») — система охлаждения, состоящая из вентилятора + радиатора, предназначенная для защиты от перегрева процессора, видеокарты, блока питания или прочих устройств
Кулхацкер (или «хацкер», от англ. «cool hacker») — человек, который считает себя куртым программистом/хакером, хотя, на самом деле, таким не является
Кэмэдэшник (от англ. «cmd») — пакетный файл семейства ОС Windows NT, имеющий расширение .cmd
Кэмэдэ  (или «командная строка», от англ. «cmd») — разновидность текстового интерфейса. Одна из возможностей ОС, позволяющая вводить команды MS-DOS и других компьютерные команды'''

l11 = '''Лаг (или «лаги», «лагать», от англ. «lag») — торможение или медленная работа какой-либо системы, к примеру, программы или компьютерной игры. Возникает по причине недостаточных характеристик устройства, либо из-за низкой скорости интернета (если речь о передаче данных по сети)
Лайфхак (от англ. «lifehack») — «хитрости жизни», «народная мудрость», т.е. полезный совет, который помогает решить какую-то проблему/задачу с экономией времени/усилий
Ламер  (или «ламо», от англ. «lamer») — 1) неопытный пользователь, человек, не разбирающийся в чём-либо, но при этом думающий, что все знает, «воинствующий» чайник; 2) среди пиратов, кракеров и фрикеров: слово синоним “лузера”, “пиявка”- тот, кто скачивает много файлов, ничего не давая взамен
Лапша — множество проводов, кабелей - обычно телефонных
Левел (от англ. «level») — в геймерской среде означает уровень, который достиг игрок, либо характеристику его успешности. В широком употреблении может означать степень успешности/навыков/способностей
Легаси-код (от англ. «legacy code») — изживший себя код, который был написан кем-то очень давно и с которым программистам теперь приходится работать
Лейбл (или «лейба», от англ. «label») — отличительный знак/наклейка на любом товаре/it-продукте, на которой указаны марка производителя, название, дата производства и т.д.
Лечить  — 1) проверять и спасать компьютер от вирусный программ; 2) фиксить (исправлять) баги, обычно самым наипростейшим способом, по принципу временного латания дыр; 3) применять лекарство (кряк) к платной программе
Либа  (от англ. «Library») — в программировании имеется ввиду библиотека кода или DLL в Windows
Ликбез  — расшифровывается как "ликвидация безграмотности", т.е. обучение неким азам, фундаментальным основам
Линкануть  (от англ. «link») — отправить кому-то необходимую ссылку на какой-либо ресурс
Линкинг  (от англ. «linking») — процесс связывания всех объектных файлов, которые генерирует компилятор, в единую программу с возможностью последующего запуска/выполнения с помощью линкера/компоновщика
Линк  (или «ссылка», «связь», «гиперссылка», от англ. «link») — 1) гипертекстовая ссылка на какой-либо сайт/ресурс/документ/урл (URL); 2) единица измерения, ранее бывшая в употреблении в америке, равная 20,11 см
Линтер  — собирательное название программ, анализирующих написанный код и предупреждающих программиста об обнаруженных ошибках
Линуксоид (от англ. «linux») — человек/юзер, пользующийся ОС Linux (Линукс)
Линукс  (от англ. «Linux») — бесплатная, полностью готовая ОС на основе ядра Linux. Исходные коды Linux доступны для изменений и просмотров любым юзером
Лиса (или «лисичка») — свободный браузер Mozilla Firefox с открытым исходным кодом, основанный в 2003 году
Лист (от англ. «List») — изменяемый список, структура данных для хранения объектов различных типов, построенная на двусвязных списках
Литерал — константа, фиксированное значение, записанное непосредственно в исходном коде программы, которые, в последствии, нельзя изменить
Лицуха  — (от лат. liсentia - «право») - лицензия/разрешение на выполнение некоторых действий, подтвержденное определенным документом. В мире it обычно имеется ввиду лицензия на ПО, дающая право на его использование
Личер (от англ. «leech») — пользователь файлообменной сети, который пользуется ресурсами других и лишь скачивает файлы, ничего не загружая взамен
Личка (или «ЛС», «л/с», «приватный чат») — личные сообщения: форма общения в Интернет-пространстве между двумя людьми, суть которой заключается в приватности диалога
Логиниться  (или «залогиниться», от англ. «login») — процесс входа в систему (авторизация в ПО, на сайте) под ранее зарегистрированной учетной записью путём ввода логина и пароля
Логин  (или «ушка», от англ. «login») — имя учётной записи пользователя на ресурсе/ в ПО, используемое для авторизации (входа в систему)
Лого (от англ. «logo») — логотип: уникальный графический элемент (эмблема), используемый компаниями/брендами для идентификации себя на рынке
Логофф (от англ. «logoff») — выход из системы (действие, противоположное авторизации), переход в режим незарегистрированного использователя ПО/сайта
Лог-файл  (или «лог», от англ. «log file») — текстовый файл (файл или таблица в базе данных) для внесения в последовательном порядке всех совершенных действия в ПО/сервере, к примеру: шаги юзеров, время произошедших ошибок и сбоев и тд.
Локализовать (от англ. «localization») — перевести ПО/ресурс на местный язык пользователей с помощью ANSI (локальной кодовой страницы)
Локализовать багу — процесс "расследования" произошедшего бага (ошибки): поиск ее в коде, выяснение причины произошедшего, изучение последствий
Локаль  (или «лан», «лана», «ланка», «лань», от англ. «locale») — 1) локальная кодовая страница (ANSI) с региональными настройками, некий стандарт, определяющий некоторые параметры: язык, часовой пояс и т.д.
Локейшн (от англ. «location») — месторасположение (в it обычно применяется к геолокации юзера, либо месту хранения файла)
Лэптоп (от англ. «laptop») — собирательное название портативных ПК: ноутбуков, нетбуков, смартбуков, планшетов и т.д.'''

l12 = '''Маздай  (или «мастдай», от англ. «must die») — оперативная система Windows (от популярного выражения «Windows 95 must die»)
Мазила  (или «мазилла», от англ. «Mozilla») — свободный браузер Mozilla Firefox на движке Quantum, разработанный Mozilla Corporation
Майнинг  (от англ. «mining») — сейчас ассоциируется, в основном, с добычей криптовалюты с помощью мощных компьютеров, выполняющих сложные математические операции
Макрос (или «макрокоманда», «макроопределение», от англ. «makros») — 1) программный алгоритм действий, написанный пользователем (обычно применяются для выполнения рутинных действий); 2) символьное имя в шаблонах, заменяемое при обработке препроцессором на последовательность символов
Малварь (от англ. «malicious software») — вредоносное программное обеспечение, созданное с целью нанести урон пользователю или компьютеру с его содержимым
Манагер  (от англ. «manager») — 1) менеджер, руководитель компании/отделения/проекта; 2) иногда, манагером пренебрежительно называют бездарного руководителя, которые не умеет принимать решения и нести ответственность
Мануал  (от англ. «manual») — краткое руководство пользователя, инструкция по использованию чего-то: ПО, оборудования, сервиса и т.д.
Массив (от англ. «array») — это совокупный тип данных, позволяющий посредством использования единого идентификатора заиметь доступ ко всем переменным одного и того же типа данных
Мастер  (или «хозяин») — компьютер, который управляет трояном на "зомби" (на зараженном ПК), некоторые мастера способны удаленно управлять в ботнетах огромным количеством "зомби", организуя атаки ДДоС
Мейл (или «майл», от англ. «E-mail») — 1) электронное письмо/сообщение; 2) иногда "мейлом" называют конкретную почтовую службу Mail.Ru
Мейнстрим (от англ. «mainstream») — направление/течение, которое в определенное время является популярным и преобладает в какой-либо сфере общественной жизни: научной, культурной, технической и т.д.
Мелкомягкие (или «мелкософт», «микромягкие», от англ. «microsoft») — компания Microsoft и все продукты, которые она выпускает
Ментор (от англ. «mentor») — наставник/учитель, опытный руководитель, который является носителем ценных знаний и умений
Меншить  (от англ. «mention») — упоминание имени другого пользователя в чатах/группах/соц. сетях c целью привлечь его внимание к диалогу или же предоставить прямую ссылку на него для удобства поиска другими участниками беседы
Меню  (от англ. «menu») — определенный набор/список команд в приложении/ПО/на сайте, с помощью которых можно выполнять необходимые операции
Мессага  (или «мессачь», «мессадж», от англ. «message») — сообщение/письмо в интернет-пространстве (на эл. почте, в чате, ICQ и т.д.)
Метр (или «мег», «МБ») — вариант названия единицы измерения информации, равной 1 мегабайту
Мёржить (от англ. «Merge») — производить объединение/слияние нескольких веток кода или данных таблиц
Мидл (от англ. «Middle Developer») — средний уровень навыков/знаний программиста в общепринятой системе измерения (джуниор/мидл/сеньор)
Мировая паутина  (от англ. «World Wide Web», «WWW») — объединенная система всех ресурсов сети Интернет, которые используют протокол HTTP («протокол передачи гипертекста»)
Митап (от англ. «meetup») — сходка/встреча специалистов из одной или близких сфер работы для взаимного обмена накопленным опытом, а иногда просто для неформального общения
Митинг  (от англ. «meeting») — в it-сфере термин употребляется применительно к собраниям/встречам, на которых обсуждаются итоги в проведенной работы, выявляются сложности и недоработки, ставятся новые цели и задачи
Модемный пул (от англ. «modem pool») — совокупность всех модемов интернет-провайдера, которые конструктивно и логически объединены меду собой и служат для обеспечения абонентов доступом к сети Интернет
Модем  (от англ. «modem») — устройство, которое осуществляет модуляцию (изменение характеристик в соответствии с изменениями входного информационного сигнала) и демодуляцию (обратный процесс при приёме данных из канала связи)
Модератор (или «модер», от англ. «moderator») — пользователь ресурса, который имеет более узкие права, чем администратор. В его функции входит следить за фактами нарушений правил (в конференции, на форуме) и пресекать их с помощью предупреждений, бана и т.д.
Модераториал  (от англ. «moderator») — в фидонете так называется «санкция» от модератора. Обычно это: предупреждение [*], строгое предупреждение [+], выговор с занесением [!] и ридонли (запрет писать сообщения) [r/o]
Моник  (или «моня», от англ. «monitor») — монитор, устройство вывода визуальной информации с компьютера
Мониторить  (от англ. «monitor») — просматривать и собирать необходимую информацию в открытых источниках, наблюдение/отслеживание чего-либо
Муар  — (от фр. moire) — некий "рисунок"/узор, который возникает при наложении двух периодических сетчатых рисунков (часто наблюдается при сканировании, растрировании изображений)
Мулька — 1) полезная фича, какая-то "изюминка" в ПО/приложении, скрытая доп. функция; 2) этикетка, ярлычок, фирменный лого (обычно на одежде)
Мультикаст  (от англ. «multicast») — передача информации сразу всей группе нуждающихся в ней получателей
Мылить  (или «намыливать», от англ. «e-mail») — имеется ввиду процесс отправки сообщений по электронной почте
Мыло (или «емейл», «мейл», «имейл», от англ. «e-mail») — индивидуальный адрес электронной почты пользователя
Мыльница  (от англ. «e-mail») — почтовая программа по обмену электронными письмами, т.е. почтовый ящик
Мыша (или «мышка», «мышь») — манипулятор/устройство для координации работы курсора и передачи необходимых команд ПК
Мышкодром  — коврик для мыши, поверхность для удобной работы с манипулятором типа "мышь"
Мэйлер (или «мейлер», «мылер», от англ. «mailer») — программа, обеспечивающая отправку и прием почты'''

l13 = '''Навбар (или «navbar») — блок с навигацией на сайте или экранная навигационная панель в интерфейсе программы
Накатить — внести изменения, развернуть, опубликовать новую рабочую версию приложения. Противоположное термину «откатить»
Накрутка  — целенаправленные действия с целью увеличения каких-либо показателей (например, лайков, репостов или подписчиков)
Наладонник  (или «карманник», «КПК») — карманный персональный компьютер, прародитель современных коммуникаторов и смартфонов
Нативный (от англ. «native») — часто используют в словосочетании "нативный код", что обозначает исходный код, написанный разработчиками, который не модифицировался позже
Нетбиос  (от англ. «NetBIOS») — протокол Microsoft Windows для работы и коммуникации ПК в сетях локального типа
Нетворкинг  (от англ. «networking») — среда/круг профессионалов определённого направления, в котором, посредством общения, можно решить определенные задачи и проблемы, а так же завести полезные знакомства
Нетмейл (или «нетмайл», от англ. «NetMail») — в фидонете аналог электронной почты для обмена личными письмами (в противовес эхомэйлу)
Нетшкаф  (или «шкаф») — браузер Netscape Navigator, выпускавшийся фирмой Netscape с 1994 по 2007 год
Не эхотажно — в фидонете означает что "нечто" не относится к эхотагу, т.е. к теме конференции
Ник  (или «никнейм», от англ. «nickname») — псевдоним/прозвище пользователя в сети (на сайте, в соц.сети, на форуме)
Нода (или «нод», от англ. «node») — узел сети фидо: любой ПК, подсоединенный к блокчейн-сети
Нодедифф  (или «ноуддифф», «ноддиф», «диф», от англ. «nodediff») — файл изменений и дополнений структуры узлов Фидо (список новых и покинувших)
Нодлист (или «ноделист», «ноудлист», от англ. «nodelist») — список узлов сети Фидонет, который еженедельно обновляется
НОК (от англ. «NOC», «Network Operations Center») — то же, что дата-центр (место для удаленного хранения и обработки данных серверов, находящихся в нем на хостинге)
Ноулайфер (от англ. «nolifer») — человек, который практически все свое свободное временя проводит с гаджетом в виртуальном мире (Интернете/соц.сетях/играх), в связи с чем не имеет личной жизни, увлечений и других дел в мире настоящем
Ноут (или «нотер», «нотик», «нутыбяка», от англ. «notebook») — сокращенно от ноутбук (переносной портативный компьютер)
Нуб  (или «нубчик», «нубас», «нубарь», «нубак», от англ. «newbie») — неопытный новичок, человек, имеющий проблемы с пониманием или применением чего-то'''

l14 = '''Область видимости (от англ. «scope») — концепция, которая определяет, где можно использовать переменную, т.е. ее доступность в коде
Обои (от англ. «wallpaper») — фоновый рисунок на рабочем столе компьютера, телефона или планшета
Обработка исключений — алгоритм обработки ошибок, которые возникают в функции и с которыми она самостоятельно не может справится (функция выбрасывает исключение, заставляя центральный процессор обратиться к ближайшему блоку кода, обрабатывающему исключения этого типа)
Оверквотинг (от англ. «overquoting») — избыток цитат в написанном тексте или цитирование технической информации, крайне не приветствуется в сети. Также бессмысленное цитирование сообщения, расположенного непосредственно перед ответом, или же многократное вложенное цитирование
Оверклокинг  (от англ. «overkloking») — увеличение производительности компьютера, разгон комплектующих: видеокарта, процессор, память
Овертайм  (от англ. «overtime») — время, которое специалист перерабатывает после окончания установленного рабочего дня, т.е. сверхурочные часы
Окирпичить — испортить какой-либо гаджет в процессе неудачной перепрошивки, превратить в «кирпич» (неработающий бесполезный прибор)
Окна (или «окошки», «форточки») — так иногда называют операционную систему Microsoft Windows из-за логотипа в виде окна
Околоайтишник — специалист, не являющийся айтишником/программистом, но работающий вместе с ними в области IT (бухгалтер, юрист, экономист, кадровик и т.д.)
Оля  (от англ. «OLE») — технология ObjectLinkingandEmbedding, дающая возможность вносить изменения в данные, которые были созданы в иной программе, не покидая основной редактор
Онлайн (от англ. «on-line») — 1) пребывание пользователя в активном режиме («в сети»); 2) противоположный понятию "оффлайн" вид общения, т.е. «в реальном времени»
ООП (или «Объектно-Ориентированное Программирование») — методология/подход в программировании, в рамках которого программы представляются в виде совокупности объектов, являющихся экземплярами определенных классов, а те, в свою очередь, образуют иерархию наследования
Опенсорс  (или «открытый код», от англ. «open source software») — ПО/софт (обычно, некоммерческие) с исходным кодом открытого типа, который может использовать/дополнять/редактировать любой желающий
Опенспейс (от англ. «open space») — рабочее пространство открытого типа без стен и перегородок, в котором специалисты работают все вместе
Операнды — 1) аргумент операции, данные/объекты, с которыми работает выражение и которые обрабатываются командой; 2) иногда операндом называют место/позицию в тексте, где должен находится аргумент операции
Оперативка (или «мозги», «ОЗУ», «RAM») — оперативная энергозависимая память ПК, отличающаяся от ПЗУ высокой скоростью чтения/записи
Оптика (от англ. «optical fiber») — сетевой оптоволоконный кабель/провод, созданный из стекла и пластика, посредством которого происходит передача луча с помощью его отражения
Оракл (или «оракул», «оракле», от англ. «oracle») — база данных Oracle Database или Oracle RDBMS (СУБД): объектно-реляционная многомодельная система управления базами данных, обычно используемая для выполнения онлайн-обработки транзакций
Ориджин  (от англ. «origin») — крайняя строка письма в эхопочте, которая содержит адрес отправителя. Часто там указывается наименование станции или какой-либо короткий занимательный текст или цитата
Ослик (или «IE», «иа») — браузер Internet Explorer, который интегрирован в ОС Windows (планомерно вытесняется веб-проводником Microsoft Edge)
ОС  (или «ось», «операционка», от англ. «Operating System») — операционная система, комплекс связанных межд собой ПО, позволяющий управлять аппаратной частью и ресурсами ПК/ноутбуков/смартфонов и т.д.
Откатить (от англ. «rollback») — убрать внесенные ранее изменения, вновь вернув предыдущую версию программы/приложения
Откат  (от англ. «rollback») — процесс возвращение к исходной версии ПО/приложения/сервиса при обнаружении ошибок и недостатков в новой
Отконнектиться (или «расконнектиться», от англ. «disconnect») — отсоединиться/отделиться от чего-либо (от проекта, от компьютера, от сети и т.д.)
Отладчик (или «дебаггер», от англ. «debugger») — ПО, посредством которого автоматизируется процесс поиска ошибок кода (отладки)
Отлаживать (от англ. «debug») — заниматься отладкой, т.е. поиском ошибок в написанном коде ПО
Отлогиниться (или «логофф», от англ. «logoff») — выйти из режима зарегистрированного пользователя системы/учетной записи в режим гостя
Отревьюить (от англ. «review») — просмотреть на предмет ошибок, прокомментировать, дать рецензию и рекомендации
Офлайн (или «оффлайн», от англ. «offline») — 1) нахождение пользователя «не в сети», или же общение «по факту прочтения» (e-mail, форумы, рассылки); 2) встреча участников мероприятия (форума, конференции и т.д.) вживую, а не в удаленном режиме
Офсайт (от англ. «official website») — официальный сайт компании/проекта, содержащий актуальную информацию
Офтопик (или «офтоп», «офф», от англ. «off topic») — сообщение, отличающееся по своей тематике от главной темы конференции/форума/разговора
Оффер (или «офер», «джоб оффер», от англ. «offer») — 1) в широком смысле - любое предложение; 2) предложение о работе/вакансия с указанием должности, обязанностей и зарплаты
Очепятка — опечатка, ошибка в написанном слове'''

l15 = '''Пага  (или «хомяк», от англ. «home page») — домашняя страница, WEB-страничка пользователя, его персональный сайт
Падаван — ироничное шутливое название стажёра или джуниора в IT-сфере
Палка  — 1) слеш - косая черта, наклоненная вправо; 2) модуль оперативной памяти
Папка  (от англ. «folder») — экранный объект в графических интерфейсах ОС и программ, некий контейнер, дающий доступ к каталогу файловой системы. Если внутри папки имеются другие папки, то их называют вложенными
Паркинг (от англ. «parking») — услуга провайдера по хранению неактивных, но зарегистрированных доменных имен
Парковаться (от англ. «parking») — хранить на сервере/у провайдера зарегистрированное, но не активное доменное имя (без сайта)
Парсер (от англ. «parser») — 1) участок кода, который ответственен за разбор; 2) круг подпрограмм, которые могут сканировать сайт, собирать и обрабатывать информацию, при этом выдавая себя за обычного посетителя; 3) объектно-ориентированный скриптовый язык программирования, предназначенный для создания HTML-страниц на веб-сервере с поддержкой CGI
Парсить  (от англ. «parsing») — сбор и анализ информации из открытых источников, разбор чего либо
Паскаль (от англ. «зascal») — один из самых известных языков программирования Pascal, представляющий собой чисто процедурный язык, который служит основой для ряда других языков
Паттерн (от англ. «pattern») — 1) наиболее эффективный способ решения характерных задач проектирования, в т.ч. проектирования ПО; 2) в графическом дизайне: бесшовный узор с неоднократно повторяющимися элементами
Патч (или «заплатка», «пач», от англ. «patch») — дополнение или обновление it-продукта (ПО/приложения), исправляющее обнаруженные ошибки/баги/глюки (процесс применения патча - пропатчивание, пропатчить)
Патч-корд  (или «коммутационный шнур», «коммутационный кабель», от англ. «Patch Cord») — кабель для сопряжения различных устройств друг с другом и подключения активного сетевого оборудования к сети Интернет
Паутина (или «всемирная паутина», «ППП», «web») — мировая сеть/сложная структура ,связанных между собой посредством гиперссылок , HTML-документов
Пень — центральный процессор торговой марки Pentium, выпускаемый компанией Intel
Перегрузка функций — это возможность определять несколько одноименных функций с разными параметрами
Переполнение (от англ. «overflow») — ситуация, когда вся память занята, т.е. запрашиваемый объем отсутствует в наличии
Периферия (от англ. «peripherals») — все внешние устройства ввода и вывода (железо), которые можно подключить к ПК
Перл (или «перловка», от англ. «perl») — язык программирования Perl, использующийся для разработки скриптов в UNIX-системах
Песочница (от англ. «sandbox») — 1) специальная область/место/среда, где программа может безопасно выполнятся; 2) на сайте одноименный раздел выделяет категорию для записей новичков (некий фильтр)
Петля (или «луп») — фрагмент аудио или видео записи, который замыкается в кольцо (петлю) для цикличного воспроизведения
Пет-проект  (или «pet-проект», от англ. «pet-project») — проект (чаще всего личный), который создается и развивается исключительно для получения опыта или как хобби (изредка перерастает в полноценный проект или даже компанию)
Пик Балмера — шуточная теория, выдвинутая Стивом Балмером. Она утверждает, что при наличии алкоголя в крови в промежутке от 0,129 до 0,138% (около 2 банок пива) программист обретает суперспособности к написанию кода
Пилить (жечь) болванку — производить запись каких-либо файлов на диск (CD-R, CD-RW, DVD-R, DVD-RW)
Пилот (от англ. «pilot») — 1) тестовая (пилотная) версия продукта, либо отдел фирмы, выбранный для опробации/обкатывания этого продукта; 2) сетевой фильтр для сохранения техники от поломок, связанных со скачками напряжения
Пинг (от англ. «ping») — программа для проверки связи в сети, ее целостности и качества; 2) характеристика скорости сетевого соединения, т.е. время прохождения пакета данных до адресата и обратно (измеряется в миллисекундах)
Пинговать (от англ. «ping») — проводить проверку ресурса на доступность с использованием утилиты «Ping»
Пинч (от англ. «pinch») — «щипающее» движение пальцами на тачскрине, которое позволяет уменьшить размер/масштаб изображения/страницы
Пират (от англ. «pirate») — человек, занимающийся воровством и незаконной продажей запатентованного авторского контента (фильмы, музыка, книги и т.д.)
Пиратка (от англ. «pirate») — нелицензионные программы/утилиты/ОС, скаченные с "пиратских" ресурсов
Писиспикер (или «писиськер», от англ. «PC speaker») — динамик, который встроен непосредственно в компьютер (обычно издает лишь писк для диагностики, но можно вывести и звук со звуковой карты)
Писюк (от англ. «PC», «personal computer») — персональный компьютер
Питон (или «пайтон», «путон», от англ. «Python») — популярный высокоуровневый язык программирования общего назначения, отличающийся хорошей читабельностью кода и чистым выразительным синтаксисом
Планка (или «плашка») — отдельный модуль оперативной памяти, содержащий микросхемы запоминающего устройства
Плюсомёт — в Фидонете метафоричное название оружия модератора, которым он раздаёт плюсы [+] , т.е. строгие предупреждения за нарушения правил эхи
Плюшки — некие бонусы/привилегии, что-то полезное и нужное (часто относятся к условиям работы или функциям приложения)
ПМК — советский программируемый микрокалькулятор типа «Электроника Б3-34» и «МК-54/-56/-61/-52»
ПО (или «ПэО», от англ. «software») — программное обеспечение: одна или несколько программ (комплекс), которые используются для нормального функционирования компьютера
Побитовые операции (от англ. «bitwise operations») — операции над отдельными битами (цепочками битов) в границах одной переменной, в т.ч. битовые сдвиги и применение побитовых операторов
Повесить — 1) выполнить какое-либо действие, которое приведет к зависанию компьютера/сервера/программы и т.д.; 2) свернуть документ или окно в панель задачь
Подвал (или «футер») — в веб-дизайне так называют нижнюю часть страницы/сайта, содержащую служебную информацию
Подкаст (от англ. «podcast») — цикл уроков видео или аудио формата, рассказы/лекции по определённой тематике, чаще всего образовательного характера
Подставка под кофе  — компакт-диск или дисковод (выезжающая панель CD-RОM)
Поженить — сделать так, чтобы что-то одно соответствовало чему-то другом
Поинт (или «пойнт», «точка», от англ. «point») — 1) член сети фидо, который не держит станцию, а пользуется адресом своего узла-босса; 2) низовой пользователь Фидонета, который не имеет даунлинков
Пойнтлист (или «поинтлист», от англ. «pointlist») — список пойнтов некоторого узла/сети/региона
Пойнтовка (от англ. «point») — вечеринка/тусовка/сходка фидошников
Полететь (или «слететь») — удалиться, перестать корректно работать/функционировать (относится к программам, драйверам, сайтам и т.д.)
Полиси (от англ. «policy») — устав сети Фидонет, утвержденный голосованием ее координаторов
Полл (от англ. «poll») — команда/файл, появление которых активирует прозвонку на ноду
Полуось — операционная система OS/2 фирмы IBM, которая до 1992 года разрабатывалась с участием Microsoft
Попап (от англ. «pop-up») — всплывающее окно на сайте/в приложении, обычно рекламного характера
Поплыла вёрстка — ситуация, когда страницы браузере отображаются некорректно (например, со сдвигом важных элементов интерфейса)
Пост (от англ. «post») — опубликованная запись/публикация/статья в интернет-пространстве (соц.сети, форуме, блоге)
Постинг (от англ. «post») — процесс создания и публикации постов в интернет-пространстве
Постить (от англ. «post») — 1) делать и публиковать посты в соцсетях, в блоге, на форуме; 2) в Фидонете означает процесс отправки сообщения в эху
Пофиксить (или «фиксить», от англ. «fix») — исправить/наладить работу, внести необходимые правки
Поюзанный (или «юзанный», от англ. «use») — нечто, использовавшееся ранее, бывшее в употреблении (б/у)
Поюзать (или «юзнуть», от англ. «use») — попробовать в использовании что-то (например, новый гаджет), протестировать неизвестный ранее функционал
Превьюшка (или «превью», от англ. «Preview») — компактные/уменьшенные в несколько раз изображения (миниатюры) для более удобного предварительного просмотра
Препроцессор (от англ. «preprocessor») — модуль компилятора, который целиком обрабатывает каждый предназначенный для компиляции файл и формирует текст, попадающий затем на вход компилятора
Приват (от англ. «private») — личная/приватная переписка двух участников чата/форума/социальной сети, недоступная для просмотра остальным пользователям
Прикрепление (или «вложение») — файлы, прикрепленные к электронному письму (документы, видео и аудио записи, изображения и т.д.)
Провайдер (от англ. «ISP», «Internet Service Provider») — компания, предоставляющая юзерам доступ к сети Интернет и дополнительные связанные с этим услуги
Провалиться (от англ. «drill down») — 1) раскрыть выпадающее меню приложения/сайта для просмотра детализированных данных; 2) перейти по клику из общей формы к необходимому файлу/документу
Прога (от англ. «program») — программа/программное обеспечение/утилита
Прогать (или «прожить», от англ. «programming») — заниматься программированием, писать код программы/приложения
Программа (от англ. «program») — комбинация/набор/перечень данных инструкций, которые позволяют компьютеру корректно работать
Программер (или «прог», «прогер», от англ. «programmer») — программист, человек, занимающийся программированием/разработкой ПО
Прод (или «продакшн», «продуктив», от англ. «production environment») — компьютер/сервер, где запускается готовое работоспособное приложение
Продакшн (или «продакшен», «продакшн-код», от англ. «production») — 1) код для рабочей версии ПО/приложения; 2) в широком смысле:процесс создания какого-либо проекта или продукта (обычно, творческого)
Продолжительность жизни переменной (или «время жизни») — показатель, который определяет период хранения переменной, когда она создается и где уничтожается
Продуктив  (от англ. «production») — 1) реальная среда работы сайта, т.е. сам сайт, установленный на сервер и доступный для посетителей; 2) продуктивная эксплуатация программного продукта
Прокси-сервер (или «прокси», «прокся», от англ. «proxy») — некое ПО/сервер, являющийся промежуточным звеном (посредником) между юзером и конечным сайтом/сервером. Прокси-сервер позволяет одним компьютерам выполнять запросы к другим от своего имени, чтобы обеспечить приватность, конфиденциальность и затруднить возможность отслеживания пользователя
Прополоть — в Фидонете: запустить прозвонку на ноду
Прорезать — добавить в интерфейс ПО/приложения дополнительный объект/элемент, который не был предусмотрен ранее стандартным решением. Вместе с тем добавить его обработку в программный код, атак же в соответствующую таблицу базы данных
Пространство имен (от англ. «namespace») — некоторая область кода, где гарантируется уникальность/оригинальность всех идентификаторов, их логическая группировка
Протокол  (или «протокол передачи данных», от англ. «data transfer protocol») — определенный стандарт/правила/соглашения по обмену данными между различными устройствами
Прототип функции  (от англ. «function prototype») — в языках Си и C++ так называют предварительное объявление функции, состоящее из ее имени, типа возврата функции и параметров (не содержит тело, т.е. основную часть функции)
Профан  — Человек без опыта в какой-либо сфере, совсем не разбирающийся в чём-то
Профит  (от англ. «profit») — 1) в широком смысле - определенный положительный результат чего-либо: прибыль/выгода/польза; 2) на бирже: разницу между вложенными инвестициями и полученным чистым доходом
Прошивка — ПО/программный код, встроенный в энергонезависимую память устройства и управляющий его работой (модем, GPS-навигатор, смартфон, маршрутизатор и др.)
Прошить  (или «перепрошить») — изменить прошивку, т.е отредактировать программный код устройства
Пул реквест (от англ. «pull request») — запрос на подтверждение коммита, т.е. на изменение кода в чужом репозитории
Пушить (или «запушить», от англ. «push») — 1) использовать команду push, публиковать что-то, например, выгружаемые локальные изменения, код на git; 2) настаивать, принуждать к чему-либо, заставлять, давить
Пуэрпоинт (или «пауэрпоинт», «паверпоинт», от англ. «PowerPoint») — программа для создания и просмотра презентаций, которая является частью Microsoft Office
Пэн  (от англ. «pan») — движение по экрану с ранее увеличенным изображением, которое позволяет увидеть части экрана, которые ранее были сткрыты
Пэхапэ  (или «пыха», от англ. «PHP») — язык программирования PHP: опенсорcный скриптовый язык, активно применяемый при разработке серверных частей современных веб-проектов
'''

l16 = '''Радиобаттон (от англ. «radio button») — элемент интерфейса, позволяющий пользователю выбрать только одну опцию (пункт) из предопределенного набора (группы). Обычно выглядит как пустой кружочек или ромбик. При выборе «зажигается»
Разраб  (от англ. «developer») — сокращение от разработчик, с намеком на тяжелый и подневольный «рабский» труд
Рандом  (или «рандомный», от англ. «random») — случайная вероятность получения определенного результата при совершение какого-либо действия
Рантайм  (от англ. «runtime») — вычислительное окружение, которое требуется для выполнения какой-либо компьютерной программы и доступное во время её выполнения
Рапида  (от англ. «rapidshare») — популярный файлообменный сервер Rapidshare, существовавший с 2005 по 2015 год
Рарить  (от англ. «RAR») — использовать программу-архиватор RAR для создания архивов
Расшарить (или «шарить», «шерить», от англ. «share») — сделать открытым/поделиться доступом к какому-то ресурсу/файлу/папке в локальной сети с одним или несколькими людьми
Реал (от англ. «real») — реальный мир, все то, что находится вне сети Интернет
Реалтайм (или «RTOS», «СРВ», от англ. «Real-Time Operating System») — операционная система, которая предназначена для обслуживания приложений реального времени, обрабатывающих данные по мере их поступления (без задержек в буфере)
Ребейс (от англ. «git rebase») — команда для синхронизации с главной веткой, в которую коммитят все разработчики проекта. Это необходимо, чтобы иметь возможность смержиться с master веткой, если кто-то изменит участок кода в совей ветке. Обычно производится перед началом рабочего дня и после его окончания, когда фича готова
Ребзя  — используется, как обращение к кому-либо, означает ребята/парни
Ребутнуть (или «ребутить», «сделать ребут», от англ. «reboot») — перезагружать электронное устройство/систему
Ревью (или «кодревью», от англ. «review») — рецензирование/вычитка/проверка кода с целью обнаружения и исправления ошибок
Регэкспы (или «регулярки», «регулярные выражения», от англ. «regexp,regular expressions») — формальный язык поиска и осуществления манипуляций с подстроками в тексте, который основан на применении метасимволов. Поддерживается практически всеми современными языками программирования
Редизайн  (от англ. «redesign») — обновление и модификация визуальной графической или структурно-функциональной составляющей приложения/сайта/интерфейса и т.д.
Редирект (от англ. «redirect») — автоматическое перенаправление/переадресация юзера куда-либо: на другой сайт, на другую страницу, на другую почту и т.д.
Резак — устройство для нарезки (записи) оптических дисков: CD, DVD
Рекурсивная функция — (от лат. recursio ) - числовая функция, содержащая в своем определении себя, т.е. она вызывает саму себя
Рекурсия (от англ. «recursion») — определение/описание какого-либо объекта/процесса с помощью самого этого объекта/процесса
Релиз (от англ. «release») — представление готовой стабильной версии продукта, прошедшей тестирование (игры/программы/песни/альбома), ее выпуск в открытый доступ
Рендер (от англ. «render») — изображение/модель, которая была сгенерирована в 3D-редакторе
Рендеринг (от англ. «rendering») — 1) преобразование данных из внутреннего формата редактора в выходной формат, процесс вывода; 2) в компьютерной графике имеют ввиду создание цифрового растрового изображения,сделанного по разработанной 3D-сцене или другим данным
Репозиторий (или «репа», от англ. «repository») — хранилище исходных файлов проекта (программ, объектов, метаданных и т. п.)
Рефакторинг кода (от англ. «refactoring») — корректировка исходного кода ПО для того, чтобы сделать его "чистым", т.е. простым и легким для понимания и последующей поддержки
Референс (или «рефка», «реф», от англ. «reference») — пример/образец, дающий приблизительное представление о том, что хотелось бы увидеть или получить в итоге
Ридми  (от англ. «read me») — файл Readme, который обычно содержит подробную информацию о программе, документацию, инструкции, которые необходимо прочитать перед первым запуском ПО
Ридонли (от англ. «read only») — 1) режим «только чтение», т.е. запрет редактирования программы/документа/презентации; 2) в Фидонете: запрет писать в эху (самый строгий модераториал/наказание от модератора)
Рисёрч (или «ресерч», от англ. «research») — поиск полезной информации, изучение определенной темы с целью разобраться в ней, понять суть, детали
РоР (или «Руби он рэйлс», от англ. «RoR», «Ruby on Rails») — Открытый и свободный фреймворк для создания веб-приложений, написанный на языке программирования Ruby. Платформа реализует архитектурный шаблон Model-View-Controller для веб-приложений, а также обеспечивает их интеграцию с веб-сервером и сервером баз данных
Роутинг (или «рутинг», «маршрутизация», от англ. «routing») — процесс определения маршрута следования информации/данных в сетях связи (трафика)
Руби (от англ. «Ruby») — интерпретируемый язык программирования высокого уровня "Ruby". Лёгкий в разработке, используется, в основном, при разработке веб-приложений
Рубиться (или «зарубиться») — увлечено играть, соревноваться с кем-либо
Ругаться — в отношении ПО/приложений: выдача уведомлений/сообщений об ошибках в коде, предупреждения и т.д.
Рулез (от англ. «rules») — выражение одобрения/похвалы чего-то (программы, проекта, ПО и т.д.)
Рулесы (или «рулеса», от англ. «rules») — правила (эхи или фэхи), которые через некоторое количество время периодически постит модератор
Рунет (от англ. «runet») — русскоязычный сегмент Интернета - совокупность сайтов с контентом на русском языке
Рут (от англ. «root») — 1) учётная запись администратора; 2) полный расширенный доступ к системе компьютера; 3) системный администратор; 4) корневая директория чего-либо; 5) отправная точка (объект) в иерархии
Руткит (от англ. «rootkit») — ПО, которая захватывает контроль над системой, маскируя следы присутствия другой программы/файлов или самой себя
Рыбий глаз (или «фишай», от англ. «fish-eye») — 1) сверхширокоугольный объектив с целенаправленно увеличенной дисторсией (коэффициент линейного увеличения, изменяющийся по мере удаления отображаемых предметов от оптической оси); 2) фото полученное с помощью такого объектива
Рэк  (от англ. «rack») — оборудование, стандартная 19-дюймовая стойка (шкаф) для ИТ-оборудования'''

l17 = '''Cёрфер  (от англ. «surfing») — в it-сфере: активный пользователь мировой паутины (www)
Cтейтмент (от англ. «statement») — в языках программирования: самая малая независимая единица, являющаяся самым распространенным типом инструкций в программах. Разработчики пишут стейтменты, чтобы выполнить какое-то задание
Саббатикал (от англ. «sabbaticals») — временный перерыв в работе/карьерный тайм-аут для сотрудника с целью избежать выгорания (или преодолеть уже наступившее), чтобы сохранить своё место на работе
Сабж (или «сабдж», «субж», «субъект», от англ. «subject») — тема электронного сообщения, предмет обсуждения/тема для диалога между людьми на форуме или другом ресурсе, тема для начала разговора/дискуссии
Сантехника — операционная система SunOS или Solaris - версии операционной системы UNIX, разработанные компанией Sun Microsystems для рабочих станций и серверов собственного производства
Саппорт (или «супорт», «поддержка», «сап», от англ. «support») — служба технической поддержки, в которую пользователи продукта или услуги могут обратиться за оказанием помощи по разрешению возникших трудностей и получением дополнительной информации
Свайп  (или «слайд», «swype», от англ. «slide») — 1) специальное "смахивающее" движение пальца по сенсорному дисплею; 2) особый способ беспрерывного набора текста одной линией на сенсорном экране в приложении Swype Keyboard
Свап (или «своп», от англ. «swap») — файл подкачки в ОС: файл/раздел жёсткого диска, предназначенный для «выгрузки» в него неиспользуемых страниц из оперативной памяти
Свитчер (от англ. «switcher») — человек, пришедший в сферу IT/программирование из другой сторонней профессии
Свитчнуть (или «свичнуть», от англ. «switch») — переключить
Сдохнуть  — сломаться/перестать работать
Сейвить (или «засейвить», «сэйвить», от англ. «save») — сохранить внесенные изменения/важную информацию
Секьюрный  (от англ. «security») — безопасный, надежный, защищенный
Семантическая ошибка  (от англ. «semantic error») — ошибка, характеризующаяся неправильной работой кода при его правильном синтаксическом строении
Сеньор (или «сеньор-помидор», «сеньйор,сениор», от англ. «Senior Developer») — самый высокий уровень знаний/подготовки и навыков специалиста в it-сфере
Сервак (или «сервер», «сервант», «сёрвер», «аппаратное обеспечение», от англ. «server») — специализированный мощный компьютер, предназначенный для выполнения сервисного ПО, хранения данных и обеспечения доступа к ним
Сервис пак (от англ. «service pack») — комплекс необходимых обновлений/улучшений ПО или ОС, поставляемый как единый установочный пакет
Сессия  (от англ. «session») — 1) в веб-аналитике: последовательность заПросов отдельного пользователя во время посещения определенного сайта; 2) период от входа на сервер/систему/сайт до выхода из них; 3) период от запуска браузера до его закрытия
Сетевик — it-специалист, который отвечает за поддержание работоспособности локальной сети (ЛВС): активного оборудования сети и СКС (структурированной кабельной системы)
Сетевуха (или «сетевуха», «сетевая плата», «сетевая карта», «сетевой адаптер») — специальное интерфейсное устройство, которое позволяет ПК взаимодействовать с другими устройствами локальной сети
Сетёвка (или «сходка», «сисопка», «фидопойка») — неформальная встреча, куда фидошники (участники Фидонета) приходят пообщаться и увидеть друг друга вживую
Сетка — 1) локальная сеть , т.е. среда взаимодействия нескольких ПК; 2) в сфере дизайна: модульная сетка, используемая для дизайна и вёрстки страниц
Сеть (с большой буквы)  — имеется ввиду Интернет: комплекс ресурсов, доступных в протоколе TCP/IP
сеть (с маленькой буквы) — связанные между собой компьютеры, независимо от протокола
Сёрфинг (от англ. «surfing») — просмотр различных ресурсов/сайтов, беглое поверхностное пролистывание страниц в Интернете
Си (или «сишка», «сижка») — популярный компилируемый статически типизированный язык программирования C, ставший основой для таких языков, как C++, C#, Java и Objective-C
Сидер  — юзер, который может инициировать раздачу, т.к. обладает готовым к раздаче файлом
Сидюк  — CD-ROM или CD-RW
Сиквел  (или «SQL», от англ. «sequel») — простой язык структурированных запросов, который имеет немного команд
Симка — 1) модуль памяти SIMM с однорядным расположением контактов (использовался в 90-х в компьютерах); 2) SIM-карта оператора связи в телефонах/смартфонах
Синбаи  (от англ. «seen by») — в Фидонете: служебные строки в конце сообщения, показывающие узлы, которым оно было доставлено
Синий экран (смерти)  (или «синяк», «бсод», от англ. «Blue Screen Of Death») — серьёзная ошибка в OС Microsoft Windows, характеризующаяся появлением "синего экрана" и требующая перезагрузки системы
Синтаксис  (от англ. «syntax») — порядок/правила, регулирующие построение предложений
Синтаксическая ошибка  (от англ. «syntax error») — ошибка, возникающая при написании кода, не соответствующего правилам грамматики выбранного языка программирования
Сионист (или «сишник») — it-специалист, который программирует (пишет код) на языке Си
Сисадмин  (или «системный администратор», от англ. «System Administrator») — специалист, занимающийся обеспечением бесперебойной работы всех компьютерной техники компании, сети и ПО
Сисоп  (от англ. «System Operator») — системный оператор/админ ББС (Bulletin Board System) или фидошного узла, который отвечает за поддержание стабильной работы, и регулярное обновление файловой базы и др.
Система  (от англ. «system») — 1) операционная система (ОС) компьютера; 2) комплекс железа (аппаратного обеспечения) и софта (ПО) в одной конкретной установке (ПК)
Системник (или «корпус», «коробка», «системный блок») — элемент ПК, "внешняя оболочка", обеспечивающая защиту внутренних компонентов компьютера от механических повреждений и внешнего воздействия
Скилл (или «скиллы,скилы», от англ. «skill») — навыки, умения, мастерство в определенной сфере деятельности
Скин (или «шкурка», от англ. «skin») — внешний вид/оболочка/дизайн приложения/ПО/системы, который пользователь может изменять самостоятельно по своему желанию
Скипнуть  (от англ. «skip») — пропустить или пролистать (обычно применяется к уведомлениям или рекламе)
Скопипастить (от англ. «copy-paste») — позаимствовать/скопировать откуда-либо информацию и без изменений добавить ее в свой проект
Скрам (от англ. «scrum») — один из методов управления проектами, является частью гибкой методологии разработки Agile. Обычно используется в сфере разработки ПО, но может применятся и в других производственных отраслях
Скрин (или «скриншот», от англ. «screenshot») — снимок экрана компьютера или смартфона в данный момент времени, сохраненный в графический файл
Скринсейвер (от англ. «screensaver») — заставка на экране (как правило, динамическая), которая активируется во время того, как пользователь не производит каких-либо действий и «сохраняет экран»
Скрипт (от англ. «script») — 1) программный файл сценария (часть написанного кода), автоматизирующий какую-то задачу, предотвращая работу вручную; 2) некий сценарий, где прописан ход беседы/последовательность действий при общении с клиентом (по телефону, лично в точке продаж и т.д.)
Скроллинг (от англ. «scrolling», «scroll») — прокрутка экрана (колесом мыши, бегунком на странице или движением пальца по сенсорному дисплею) с целью просмотра большого блока информации (например, длинная статья или книга)
Слайд (от англ. «slide») — 1) отдельная «страничка» в презентации, используемая для визуализации необходимой информации; 2) то же, что и "свайп", т.е. "смахивающее" движение по экрану
Слететь (или «слёт») — в отношении компьютерного ПО: ситуация, когда установленные ранее настройки/параметры внезапно и незапланированно стерлись или подверглись изменению. Иногда, имеют ввиду резкое прекращение работы программы/приложения
Слить (от англ. «merge») — 1) загрузить файлы с сервера на локальный компьютер; 2) предоставить в общественный доступ чью-то личную информацию/фото/видео и т.д.
Слоупок (от англ. «slowpoke») — характеризует медлительных несообразительных людей (название пришло из Аниме: так звали розового покемона - Slowpoke)
Сниппет (от англ. «snippet») — фрагмент, небольшая часть чего-то (исходного текста/програмного кода), пригодная для вторичного использования
Сносить (или «снести») — удалять, деактивировать, стирать имеющиеся настройки, деинсталлировать ПО
Собес (или «собеседование», от англ. «interview») — беседа представителя работодателя с кандидатом на вакантную должность
Софт (от англ. «software») — программное обеспечение (ПО): совокупность программ, установленных на конкретном компьютере
Софт скиллы (от англ. «soft skills») — навыки социализации в обществе: социальные/коммуникативные/личностные качества человека, необходимые, в том числе, для адаптации в коллективе
Спам (от англ. «spam») — "надоедливые" электронные письма и сообщения с рекламой, которые получают пользователи, не соглашавшиеся на рассылку
Спамить (от англ. «spam») — 1) отправлять спам (рекламные сообщения и письма); 2) писать множество писем/сообщений (то же, что "флудить")
Сплит (от англ. «split») — 1) разделение очень длинной строки на отдельные части; 2) утрата синхронизации между разными серверами в единой сети
Спрайт  (от англ. «sprite») — в компьютерной графике: графический объект, растровое изображение, отображающееся на экране
Спринт  (от англ. «sprint») — в методологии управления проектами Scrum: обозначенный временной отрезок (обычно от 1 до 4 недель), за который специалисты обязаны успеть выполнить поставленную задачу
Статическая библиотека (от англ. «Static Library») — включает в себя подпрограммы, которые компилируются и линкуются с вашей программой. При компиляции программы, использующей статическую библиотеку, весь функционал библиотеки становится частью вашего исполняемого файла
Статическая переменная (или «переменная со статической продолжительностью жизни», от англ. «Static variable») — переменная, сохраняющая свое значение даже после выхода из блока, в котором она определена (создается и инициализируется всего единожды, а после сохраняется на протяжении выполнения всей программы
Стек (от англ. «Stack») — 1) в широком смысле: абстрактный тип данных; 2) список технологий, применяемых разработчиком или компанией
Стек вызовов  — отслеживает все активные функции (уже вызванные, но пока не завершенные) от начала программы и до текущей точки выполнения, а атк же обрабатывает выделение всех параметров функции и локальных переменных
Стретч (от англ. «stretch») — «растягивающее» движение пальцами на тачскрине, которое позволяет увеличить размер/масштаб изображения/страницы
Стрим (от англ. «stream») — онлайн-трансляция происходящих в данный момент событий/действий
Стример (от англ. «stream») — человек, который организует/запускает стрим (онлайн-трансляцию)
Стримить (от англ. «stream») — процесс проведения стрима (онлайн-трансляции)
Струйник — струйный принтер с одномерной технологией печати (медленная скорость печати по сравнению с лазерным)
Структура (от англ. «structure») — пользовательский тип данных, позволяющий объединить переменные различных типов в едно целое
Субдомен (или «поддомен», «дочерний домен», от англ. «subdomain») — часть домена/отдельный сайт, содержащий в своем имени доменное имя основного сайта. Их создание необходимо, когда нужно создать продолжение к имеющемуся сайту, наделив его определённой функцией Т'''

l18 = '''Таглайн  (или «тэглайн», от англ. «TagLine») — строчка в конце письма, которая является необязательной. Обычно это часть подписи, в которой содержится крылатое выражение, цитата, шутка и т.д.
Тап  (от англ. «tap») — короткое быстрое нажатие на элемент интерфейса дисплея телефона или планшета, по аналогии с щелчком мышью н компьютере. Соответственно, даблтап – двойное нажатие
Таска (от англ. «task») — какое-либо задание/поручение
Таски (от англ. «task») — заданные цели/задачи, которые предстоит решить
Тачка — так айтишники иногда называют свой компьютер
Тач-н-холд (от англ. «touch and hold») — нажатие и продолжительное удержание пальца или стилуса на тачскрине
Тачпэд (или «тачпад», от англ. «touch pad») — специальная сенсорная панель (на ноутбуке или клавиатуре для Smartт -TV), прикасаясь к которой можно отдавать команды подключенному устройству
Тачскрин (от англ. «touch screen») — сенсорный экран/дисплей устройства (смартфона, планшета, смарт-часов, банкомата и т.д.), который реагирует на касания пальца и позволяет управлять гаджетом без использования кнопок
Тач  (от англ. «touch») — 1) используется как синоним тачпэда или тачскрина; 2) более продолжительное, чем "тап", нажатие на сенсорный экран мобильного гаджета. В десктопах аналога не имеет
Твинк (от англ. «Twink он же Read-only-user») — 1) в общем смысле: учетная запись, дающая пользователю право только на чтение (просмотр) документа/файла, без возможности редактирования; 2) на форумах: дополнительные учетные записи пользователя, созданные в качестве запасных на случай блокировки основной (иногда, для сокрытия своей личности)
Темплейт (от англ. «template») — шаблон/заготовка, своего рода каркас для документа или письма
Тест (от англ. «test») — 1) данные, которые были специально созданы (или подобраны) для организации тестирования продукта (ПО/приложения); 2) система тестирования (в отличие от продуктивной системы или системы разработки)
Тестировщик (или «тестер», от англ. «tester») — it-специалист по тестированию ПО, находящегося в разработке
Технарь (от англ. «technic») — 1) в широком смысле: любой человек с техническим (не гуманитарным) образованием; 2) специалист, работающий в бэкенде (бэкенд-разработчик)
Тимлид (от англ. «team leader») — главный разработчик, человек, имеющий в подчинении свою команду разработчиков
Тирлайн (или «тиарлайн», от англ. «TearLine») — в Фидонете: специальная строка, обозначающая завершение текста письма (начинается тремя минусами)
Тисипиайпи  (от англ. «TCP/IP») — сетевая модель передачи данных, представленных в цифровом виде. Модель описывает способ передачи данных от источника информации к получателю
Тиснуть — сделать клик по кнопке /ссылке/иконке и т.д.
Тонна — терабайт, единица измерения количества цифровой информации
Топтать кнопки — активно печатать что-либо на клавиатуре
Торрент (или «BitTorrent») — технология передачи файлов через Интернет от пользователя к пользователю (без посредничества сервера). Позволяет быстро и эффективно загрузить необходимый файл
Тоссер (или «эхотоссер», «эхопроцессор», от англ. «tosser») — в Фидонете: специальная программа,которая занимается тоссингом , т.е. обработкой баз сообщений
Тоссинг (или «тоссенье», от англ. «toss») — размещение в базе сообщений почты, которую принял мейлер, а также сбор из этих баз уже написанных сообщений и подготовка их к отправке
Точка останова (от англ. «breakpoint») — особый маркер, на котором прерывается процесс выполнения программы и вызывается отладчик
Трабл (или «трабла», «грабли», от англ. «trouble») — беда, проблемы, хлопоты, неприятности
Транслитерация (или «транслит», от англ. «transliteration») — точная побуквенная передача какого-либо текста одной языковой системы знаками/символами другой (например: «pr1vet», 4to delaesh?)
Трафик (или «траффик», от англ. «traffic») — 1)массив информации в интернете; 2) количество данных, загруженных из интернета; 3) в Фидонете: объём писем в килобайтах, которыйза определенный временной отрезок проходит через станцию/конференцию
Трейни  (от англ. «trainee») — стажёр, младший сотрудник, работник, который не дотягивает знаниями/навыками до уровня Junior-специалиста
Тролль — человек, намеренно провоцирующий ссоры и скандалы в различных коммуникационных сетях (чатах, форумах и т.д.)
Троян — разновидность вредоносной программы, проникающая в компьютер под видом легитимного ПО и выполняющая команды с удаленного ПК
ТС (или «топик стартер», от англ. «topic starter») — инициатор дискуссии, т.е. человек, предложивший к обсуждению какую-либо тему
ТСП (или «туда-сюда протокол», «TCP», от англ. «Transmission Control Protocol») — транспортный протокол: один из основных протоколов, отвечающий за передачу данных и их сохранность
Тултип (от англ. «tooltip») — подсказка, всплывающая при наведении курсора на какой-либо активный объект интерфейса
Туториал (или «тутор», от англ. «tutorial») — свод подробных обучающих уроков на какую-либо тему
Тэдэшка (или «ТД») — техническая документация: набор графических и текстовых документов проекта
ТэЗэ (или «ТЗ», «техзадание,тэзэшка») — техническое задание: содержит основную информацию о цели и задачах проекта, принципах и правилах его выполнения'''

l19 = '''Убить — означает стереть/удалить что-либо. Например: "убить приложение", "убить эту версию сайта"
Указатель (от англ. «pointer») — переменная, представляющая собой адрес ячейки памяти
Упс (или «UPS», от англ. «Uninterruptible Power Supply») — источник (устройство) беспрерывного питания
Урл (или «урла», «урээл», от англ. «URL») — унифицированный указатель ресурса, определенный шаблон записи гипертекстовых ссылок на объекты в Интернете. Простыми словами, это адрес странички в Сети
Установочник (или «дистрибутив», «инсталятор», от англ. «set up») — программа, устанавливающая выбранное ПО на компьютер
Утечка памяти — процесс неконтролируемого уменьшения объёма свободной оперативной или виртуальной памяти компьютера, связанный с ошибками в работающих программах, вовремя не освободивших ненужные участки памяти
Утилита (или «утилитка», «тулза», от англ. «utility») — вспомогательное программное обеспечение, предназначенное для выполнения вспомогательных работ, настройки системного оборудования, операционных систем и прочего. Другими словами, программа, которая помогает что-то сделать
Уши  — наушники - устройство для персонального прослушивания звуковых сигналов с устройства (музыка, речь и т.д.)'''

l20 = '''Фаервол  (или «брандмауэр», от англ. «fire wall») — программа-антивирус, обеспечивающая обнаружение и защиту компьютера от вирусов и вредоносных ПО
Файлопомойка (или «файлообменник») — 1) файловый ресурс (BBS, ftp-сервер) с огромным перечнем беспорядочных несортированных похожих между собой файлов; 2) сервер сети с ресурсами, доступными для общего пользования, на который юзеры сохраняют всё, что необходимо
Файлэха (или «фэха», «эха», «эхехеха») — файловая эхоконференция - форма общения всети Фидонет, средство для рассылки нетекстовых данных
Факап (или «облом», «фиаско», от англ. «fuck up») — неудача/провал/облом (чаще имеют ввиду крупные/серьёзные ошибки
Фак  (или «ЧаВо», от англ. «FAQ») — блок ответов на часто задаваемые вопросы. Такой формат материала популярен на различных интернет-площадках и преследует цель заранее дать ответы на популярные вопросы пользователей
Фаста — (фидошн.) — тоссер FastEcho: пакет ПО (эхопроцессор) для обработки сообщений почтовых систем FTN
Фаундер (или «фундер», от англ. «founder») — 1) основатель, создатель, инициатор чего либо; 2) фаундер в IRC-канале форума (тот, кто создал канал)
Фидбек (от англ. «feedback») — 1) обратная связь, отзыв, рецензия о чем-либо; 2) в коммерческой сфере: любое упоминания от покупателя/пользователя в сети (отзыв, комментарий, сообщение)
Фидо (или «Фидонет», от англ. «FidoNet») — глобальная любительская некоммерческая не анонимная компьютерная сеть (аналог интернета), созданная по технологии «из точки в точку»
Фидошник (или «фидорас») — член сети фидо, имеющий фидошный адрес
Филе (или «филесы», «файло», от англ. «file») — русифицированное произношение английского file - "файл"
Фича (от англ. «feature») — уникальная особенность/свойство/функция какого либо объекта (ПО, приложения, ОС)
Флейм (или «флэйм», «флэйминг», от англ. «flame») — "спор ради спора", дискуссия, в ходе которой давно утеряна изначальная суть, продолжается в грубой форме с переходом на личности
Флеймер (или «флэймер», от англ. «flamer») — пособник флейма (спора ради спора) или человек, который по своему характеру склонен к его разжиганию и поддержанию
Флик (от англ. «flick») — щелчок по дисплею сенсорного устройства наискосок, после которого происходит движение экрана в заданном направлении
Флоп (или «флопик», «флопак», «флопарь», «флоповод», «флоповёрт», «флопогрыз», «флопоглот», от англ. «floppy») — флоппи-дисковод, предназначенный для считывания информации с дискеты (и записи на нее)
Флуд (от англ. «flood») — засорение чатов или других каналов связи различной информацией, не имеющей отношения к тематике канала (мемы, картинки, текст, обилие сообщений)
Флудить (от англ. «flood») — инициировать появление/генерирование флуда, т.е. обилия информации, не относящийся к теме канала
Флэшка (или «флэха», «флешка», от англ. «flash drive») — 1) компактное переносимое запоминающее устройство, которое подключается к ПК через USB-порт; 2) программа на flash
Форвард (или «форварднуть», «отфорвардить», от англ. «forward») — Форвард (форварднуть, отфорвардить, от forward) – переслать поступившее письмо другому пользователю
Формошлёп (от англ. «form») — 1) человек с низкой квалификацией, работающий исключительно по готовым шаблонам; 2) специалист, занимающийся разработкой шаблонов веб-сайтов или их версткой (формошлёпством)
Форум (от англ. «Forum») — некоторый сайт/ раздел, созданный с целью организации возможности общения пользователей ресурса
Форумчанин (от англ. «Forum») — завсегдатай/участник, регулярно участвующий в обсуждениях на форуме
Фотожаба — любительский фотомонтаж в графическом редакторе, созданный участниками какого-либо сообщества/форума специально под конкретное выложенное изображение
Фотошоп (или «фотожоп», «фотожопа», от англ. «Photoshop») — 1) графический редактор Adobe Photoshop; 2) фотожаба, фейковое обработанное изображение/фото
Фреймворк (от англ. «framework») — специальная платформа/ПО, главной задачей которой является облегчение создания, поддержки и объединения разнообразных компонентов проекта/приложения/сервиса и т.д.
Фрек (или «фрэк», «фидошн», от англ. «freq», «file request») — файловый запрос (способ, который позволяет одной фидонетовской системе во время сеанса связи с другой запросить у неё некоторые файлы)
Фривар  (от англ. «freeware») — ПО, находящееся в свободном доступе (бесплатное)
Фрикер  (от англ. «phreaker») — человек, промышляющий взломом ПК, компьютерных и телефонных сетей (использует для взлома не только технологии, но и человеческий фактор: выведывание, подглядывание, обман, шантаж и т.д.
Фриланс (от англ. «freelance») — оплачиваемая работа на дому (вне официального штата сотрудников ) Часто фрилансер работает на себя и не имеет постоянных заказчиков и начальства
Фрилансер (от англ. «freelancer») — человек, занимающийся фрилансом (работой на дому: на себя или компанию)
Фронтенд (от англ. «front-end») — создание «внешней оболочки» веб-сайта/приложения (то, что видит пользователь)
Фронтендер (от англ. «front-end») — it-специалист, разработчик фронтэнда (внешнего вида програмного продукта)
Фубар (или «Foo и Bar») — наименования функций/переменных, по которым сложно судить об их назначении (допускается использование в учебной литературе, но запрещается в настоящих проектах)
Фуллстек-разработчик (от англ. «full stack») — разработчик, который одновременно трудится в бэкендее и фронтэнде
Функция (от англ. «function») — это ряд стейтментов для реализации некоторой задачи/задания
Фьюбар (от англ. «Fucked Up Beyond Any Repair/Recognition») — слово общего назначения, дословно переводится с английского как «раздолбанное до неузнаваемости»'''

l21 = '''Хабовка (от англ. «hub») — разновидность сетёвки, где располагаются даунлинки одного хаба со своими пойнтами
Хаб  (от англ. «hub») — 1) узел какой-либо сети; 2) сетевой концентратор (распространяет трафик от одного подключённого устройства ко всем остальным); 3) крупный раздающий узел сети
Хак (от англ. «hack») — 1) первоначально (появилось в университете Беркли) модификация кода программы, которая позволяет минимизировать размер программы, расширить функционал или ускорить работу, наконец, просто красивое программистское решение; 2) процесс взлома защиты чего-либо, обход какой-либо проблемы; 3) программа-модификатор
Хакатон (от англ. «hack marathon») — мероприятие, где встречаются специалисты из разных отраслей разработки ПО (программисты, дизайнеры, тестеры и т.д.) для работы над общим проектом: приложением, программой
Хакать  (от англ. «hack») — 1) работать над чем-либо; 2) изучать что-либо; 3) видоизменять написанный код, делать его "красивым": устранять ненужные функции или добавлять новые
Хакер (от англ. «hacker») — 1) увлеченный знаток компьютерной техники и ПО, являющийся экспертом в этой области (имеет лишь исследовательский интерес, без злого умысла); 2) синоним "кракера", кибер-преступника, т.е. человек, использующий свои технические знания во вред другим (взломать, заразить вирусом, добыть закрытую информацию и т.д.)
Хакинг (от англ. «hack») — процесс преобразования некоторых элементов ПО для определённых целей, которые ему не свойственны
Хард (или «винт», «харддиск», от англ. «hard disk») — накопитель, состоящий из жёстких магнитных дисков (НЖМД, жёсткий диск, винчестер); 2) аппаратное обеспечение компьютера, т.е. его комплектующие
Хардкодить (от англ. «hardcore») — привычка статически прописывать в коде данные, которые по правилам должны вычисляться динамически. Практика считается плохой, антипаттерн в программировании
Хард скиллы (от англ. «hard skills») — лубокие/значительные технические знания, умения и опыт
Хатчить  (от англ. «hatch») — загружать/"закидывать" какие-либо файлы в файлэху
Хатээмэль (или «хатэмээль», «хэтемээль») — руссифицированное произношение HTML (HyperText Markup Language): язык гипертекстовой разметки, который используется для написания документов для веб-сайтов
Хидден  (от англ. «hidden») — 1) то, что существует, но сокрыто от посторонних взглядов (к примеру, некоторые элементы интерфейса); 2) в Фидонете: невидимая/скрытая служебная строчка в письме; 3) логический HTML-атрибут, который скрывает элементы, которым назначен
Хинт (от англ. «hint») — 1) в общем смысле: совет/рекомендация/подсказка; 2) в графическом дизайне: элемент интерфейса, представляющий собой всплывающий текст-подсказку для обучения юзера
Хит  (от англ. «hit») — 1) просмотр одной странички сайта; 2) запрос к веб-серверу с целью получения необходимого файла (страницы, картинки, скрипта, таблицы и т. д.)
Холивар (или «холивор», от англ. «holy war») — дословно "святая война", агрессивный спор между представителями противоположных мнений в интернете
Хомяк (или «пага», от англ. «home page») — 1) стартовая (домашняя) интернет страница, открывающаяся при открытии браузера; 2) персональный сайт
Хост (от англ. «hosting») — центральный сервер сети (любой компьютер), подключённый к локальной или глобальной сети
Хостер (или «хостинг-провайдер», «веб-хостер», «HSP», от англ. «hosting») — компания, предоставляющая услуги хостинга (размещения на своей площадке сайтов/оборудования/данных)
Хостинг — услуга, позволяющая разместить свой сайт на выделенном или виртуальном сервере
Хоститься (от англ. «hosting») — пользоваться услугами хостингов
Хоткей (от англ. «hotkey») — горячая клавиша (или сочетание клавиш для быстрого доступа к необходимым командам
Хотфикс (от англ. «hot fix») — исправление обнаруженных ошибок (багов), требующее немедленного решения/с горящими сроками
Хрюша — 1) транслитерация ОС Winsows XP (также: хря, хэрэ, хрень); 2) специалист HR (от «Human Resources»), занимающийся подбором/рекрутом кадров.
Хэдер (или «хедер», от англ. «header») — 1) элемент веб-страницы, расположенный в верхней его части и содержащий: логотип, меню, служебную информацию и т.д. 2) заголовочный файл библиотеки (.h)
ХэПэ (или «хьюлет пакарт») — русифицированная аббревиатура компании Hewlett Packard'''

l22 = '''Целочисленный тип данных — тип, при котором переменные способны содержать исключительно целые числа (без дробной части)
Цикл (от англ. «Cycle») — в программировании: некая языковая конструкция, заставляющая программу неоднократно исполнять определенные инструкции до тех пор, пока заданное условие не станет ложным/истинным
ЦМ (или «ЦМный», «цээм», «цээмный») — круглосуточный; происходит от того, что в строке нодлиста для круглосуточно работающего узла ставится флаг CM (от Continuous Mail — беспрерывная передача почты)
ЦОД (или «центр обработки данных», «дата-центр», от англ. «data center») — место расположения (хостинга) серверов/ИТ-инфраструктуры с целью обеспечения их бесперебойного функционирования
ЦП (или «проц», «цпу», «процик», «CPU», от англ. «central processing unit») — компьютерный компонент, обрабатывающий машинный код. Отвечает за интерпретацию и выполнение большинства команд от другого аппаратного и программного обеспечения компьютера
Цэмээс (или «цээмэс», от англ. «CMS») — система управления контентом, которая используется для обеспечения и организации совместной работы над его созданием, редактированием и управлением
Цээсэс  (от англ. «Cascading Style Sheets») — формальный язык, в котором содержится набор определенных свойств для описания внешнего вида любых HTML документов'''

l23 = '''ЧаВо (или «FAQ», «фак») — сокр. от «ЧАсто задаваемые ВОпросы». Блок ответов на часто задаваемые вопросы. Такой формат материала популярен на различных интернет-площадках и преследует цель заранее дать ответы на популярные вопросы пользователей
Чайник — новичок, неопытный начинающий пользователь, который пока плохо разбирается в чем-либо
Чат  (от англ. «chat») — способ общения пользователей сети в режиме реального времени, по средствам обмена текстовыми сообщениями
Чекать  (от англ. «check») — что-то проверять, просматривать на предмет необходимой информации или для поиска ошибок
Чекбокс  (или «флажок», «флаговая кнопка», «галка», от англ. «check box») — элемент графического интерфейса, который дает пользователю возможность управлять параметром с двумя состояниями (например, ☑ включено и ☐ отключено)
Чекиниться (или «зачекиниться», от англ. «check-in») — поставить отметку, подтверждающую ваше присутствие в каком-то определенном месте/мероприятии
Челлендж (от англ. «challenge») — 1) необычная нестандартная проблема/задача, решение которой можно считать своим достижением; 2) в социальных сетях: некая последовательность действий/слов, которую повторяет большое количество пользователей
Червь (от англ. «worm») — вирус (вредоносное ПО), проникающий в компьютер через локальную/глобальную компьютерную сеть
Черрипик (от англ. «cherry picking») — Команда git cherry-pick применяется для перенесения некоторых коммитов из одного места репозитория в другое
Читерство (от англ. «cheating») — в компьютерных играх: процесс приобретения обманным путем каких-либо привилегий путем использования чит-кодов и специального ПО
Чит-код (или «чит», от англ. «cheat code») — в сфере компьютерных игр: определенных набор символов, который вводится в командную строку для получения каких-либо ресурсов/преимуществ/привилегий
Читкодер (или «читер», от англ. «cheat code») — в сфере компьютерных игр: игрок, применяющий специальные чит-коды, которые дают определенные привилегии и бонусы
ЧПУ — расшифровывается как "человекопонятный url". Это адрес страницы, отображаемый в адресной строке, состоящий из понятных для пользователя символов, коротко отражающих содержание активной страницы
ЧСВ — сокращение от "Чувство Собственной Важности". Людей с завышенной самооценкой часто называют чсвэшниками'''

l24 = '''Шаблон (от англ. «pattern») — дает возможность создать единую версию функции/класса (экземпляр), работающую с различными типами данных
Шаблоны функций (от англ. «Function Template») — в языке С++: функции, использующиеся как образец/шаблон при создании похожих функций без уточнения типа(ов) некоторых или всех переменных)
Шара (или «шары», «шарные или расшареные ресурсы», от англ. «shared») — открытые для общего доступа файлы, папки, диски и т. п.
Шарить  — 1) хорошо понимать, отлично разбираться в чём-либо; 2) "шерить", т.е. давать дугим доступ к чему-то, обычно к определенным папкам, файлам, хранилищам
Шаровары (от англ. «shareware») — коммерческое ПО, которое является условно-бесплатным, т.е. его свободное распространение не подразумевает его принадлежность к свободному ПО
Шарпы — современный объектно-ориентированный язык программирования C# (в противовес языку C++ – «плюсам»). Его применяют при работе с программами для ПК, создании сложных веб-сервисов или мобильных приложений
ШАР  (или «WAP») — протокол беспроводного доступа /передачи данных WAP, созданный для сетей GSM. Он позволяет установить связь мобильного устройства с сетью Интернет без помощи компьютера/модема (например, «зайти с телефона на шар», то есть на WAP-портал)
Шильдик (от англ. «nameplate») — наклейка/табличка, содержащая информацию о маркируемом изделии: модель/основные технические характеристики и т.д.
Ширина пула  (от англ. «pool») — число модемов в модемном пуле (зачастую, у интернет-провайдера)
Шланг (или «шнурок») — сетевой кабель для интернет-соединения и передачи данных
Шредер (от англ. «shredder») — 1) агрегат для утилизации использованной офисной бумаги; 2) ПО, предназначенное для полного удаления файлов с компьютера (избегая корзины)'''

l25 = '''Эксель  (или «эксэль», от англ. «Excel») — табличный процессор Microsoft Excel - популярная программа для работы с электронными таблицами
Экскоммуникация — отключение системы от фидо, т.е. отказ узлов сети в установлении связи с экскоммуницируемым узлом сети («экскоммуницировали» значит «выгнали из фидо»)
Эксплойт (от англ. «exploit») — фрагмент кода или вредоносная программа кода, которая способна выполнять атаки на вычислительную систему через найденную уязвимость в другой программе
Электронная почта (или «Емейл», «мыло», от англ. «e-mail») — технология и служба по отправке и получению сообщений в электронном формате между пользователями компьютерной сети
Эникейщик (от англ. «any key») — работник IT-сферы с низкой квалификацией, занимающийся шаблонными, простыми задачами
Эникей  (от англ. «any key») — любая клавиша на клавиатуре. Нередко, при установке или загрузке программы/приложения, всплывает уведомление “Press any key” — отсюда и термин
Эпикфэйл (от англ. «epic fail») — дословно переводится как "эпический провал". Фиаско, крах, серьезная неудача
Эфайщик — эксперт по модулю SAP FI , автоматизирующий процессы бухгалтерского и финансового учета
Эффект боке (или «расфокус», от англ. «Bokeh effect») — намеренное мягкое размытие/"замыливание" заднего (или переднего) плана в процессе фото-съемки для выделения главного объекта. При использовании фотоаппарата достигается путём регулировки фокусного расстояния, а в смартфонах реализуется с помощью специальных программ или за счёт нескольких камер с разным фокусным расстоянием
Эха  (или «эхоконференция») — в Фидонете: форма общения, аналогичная по составу и своим возможностям новостным группам, т.е. представляет собой место публикации сообщений по определённой тематике
Эхотаг (от англ. «Echo tag») — строка со служебным названием эхоконференции (эхи)'''

l26 = '''Юзабилити (от англ. «usability») — показатель удобства работы пользователя с тем или иным продуктом или объектом
Юзать (от англ. «use») — использовать/применять/пользоваться (например: "дай мне поюзать твой самокат")
Юзверь (от англ. «use») — то же, что "юзер", только еще более активный
Юзер (от англ. «user») — активный пользователь компьютера или Сети, идет сразу после "чайника"
Юзерпик  (или «аватар», «аватарка», от англ. «user picture») — графическое обозначение пользователя в Интернете (картинка/фото/изображение)
Юзнуть  (или «поюзать», от англ. «use») — немного попользоваться каким-то устройством, попробовать разобраться с незнакомым функционалом приложения/программы
Юникс (или «юних», «уних», от англ. «Unix») — семейство гибких, многозадачных и многопользовательских ОС, характеризующихся модульным дизайном, где каждая задача выполняется отдельной утилитой, взаимодействуя посредстом единой файловой системы'''

l27 = '''Яблочник (или «яблофаг», от англ. «Apple») — активный пользователь устройств бренда Apple или ярый фанат компании Apple
Яндекс (от англ. «Yandex») — поисковая система и интернет-портал от российской транснациональной компании
ЯП — язык программирования - формальный язык, предназначенный для записи компьютерных программ
Ярлык  (или «шорткат», «шорткут», от англ. «shortcut») — разновидность значка, указывающего на объект. У объекта может быть бесконечно много ярлыков. Их размещают там, где это удобно (обычно на рабочем столе), и используют для обращения к объектам (чаще всего для запуска программ)'''


arr_l1 = l1.split('\n')
arr_l2 = l2.split('\n')
arr_l3 = l3.split('\n')
arr_l4 = l4.split('\n')
arr_l5 = l5.split('\n')
arr_l6 = l6.split('\n')
arr_l7 = l7.split('\n')
arr_l8 = l8.split('\n')
arr_l9= l9.split('\n')
arr_l10 = l10.split('\n')
arr_l11 = l11.split('\n')
arr_l12 = l12.split('\n')
arr_l13 = l13.split('\n')
arr_l14 = l14.split('\n')
arr_l15 = l15.split('\n')
arr_l16 = l16.split('\n')
arr_l17 = l17.split('\n')
arr_l18 = l18.split('\n')
arr_l19 = l19.split('\n')
arr_l20 = l20.split('\n')
arr_l21 = l21.split('\n')
arr_l22 = l22.split('\n')
arr_l23 = l23.split('\n')
arr_l24 = l24.split('\n')
arr_l25 = l25.split('\n')
arr_l26 = l26.split('\n')
arr_l27 = l27.split('\n')


lists = [arr_l1, arr_l2, arr_l3, arr_l4, arr_l5, arr_l6, arr_l7, arr_l8, arr_l9, arr_l10, arr_l11, arr_l12, arr_l13, arr_l14, arr_l15, arr_l16, arr_l17, arr_l18, arr_l19, arr_l20, arr_l21, arr_l22, arr_l23, arr_l24, arr_l25, arr_l26, arr_l27]

alphabet_arrays = {
    'а': arr_l1,
    'б': arr_l2,
    'в': arr_l3,
    'г': arr_l4,
    'д': arr_l5,
    'е': arr_l6,
    'ж': arr_l7,
    'з': arr_l8,
    'и': arr_l9,
    'к': arr_l10,
    'л': arr_l11,
    'м': arr_l12,
    'н': arr_l13,
    'о': arr_l14,
    'п': arr_l15,
    'р': arr_l16,
    'с': arr_l17,
    'т': arr_l18,
    'у': arr_l19,
    'ф': arr_l20,
    'х': arr_l21,
    'ц': arr_l22,
    'ч': arr_l23,
    'ш': arr_l24,
    'э': arr_l25,
    'ю': arr_l26,
    'я': arr_l27,
}

def word_search(word):
    first_letter = word[0].lower()
    if first_letter in alphabet_arrays:
        word = word.lower()
        for i in alphabet_arrays[first_letter]:
            arr = i.split()
            if len(arr) > 0 and arr[0].lower() == word :
                    return i
            else:
                arr = []
        else:
            return f'К сожалению, такого слова нет в базе данных, однако у вас есть возможность написать менеджеру'           
    else:
        return 'Недопустимое значение😡'     



